{"resource_id": "R001", "url": "https://oer.uinsyahada.ac.id/files/original/a0810543cbd9375f5e052f20b2159042.pdf", "extracted_text": "This book is licensed under a Creative Commons Attribution 4.0 International License. Table of Contents: Preface; Chapter 1: Reconstructing and Evaluating Arguments; Chapter 2: Propositional Logic; Chapter 3: Inductive Arguments; Chapter 4: Informal Fallacies; Chapter 5: Answers to Exercises. In the preface the author explains that this textbook aims to provide tools to identify, analyze and evaluate arguments and emphasizes that mastering logic requires practice.", "extraction_method": "pdf", "text_hash": "53a944bc80e53e93b7a82022c81fb55a", "notes": ""}
{"resource_id": "R002", "url": "https://builds.openlogicproject.org/open-logic-complete.pdf", "extracted_text": "The Open Logic Text is released under a Creative Commons Attribution 4.0 International License. It is an open-source collaborative textbook covering formal meta-logic and formal methods. Contents include Naive Set Theory, Relations, Functions, Size of Sets, Classical Logic, Modal Logic and more. The project encourages reuse, modification and redistribution provided attribution is given.", "extraction_method": "pdf", "text_hash": "f6fb0d2b8baf80e95467a583104fee3a", "notes": ""}
{"resource_id": "R003", "url": "https://builds.openlogicproject.org/courses/set-theory/settheory-screen.pdf", "extracted_text": "This set theory text is a remix based on the Open Logic Text and is distributed under a Creative Commons Attribution 4.0 license.  It provides an introduction to naive set theory, relations, functions and the concept of the size of sets.  The book acknowledges the Open Logic Project as its source and notes that readers are free to share and adapt the material with proper attribution.", "extraction_method": "pdf", "text_hash": "4a3edcec87e19bf9f2b61202e68691a3", "notes": ""}
{"resource_id": "R004", "url": "https://forallx.openlogicproject.org/", "extracted_text": "forall x: Calgary is a full-featured textbook of formal logic that covers propositional and first-order logic, proofs, and natural deduction.  The book includes numerous exercises and solutions.  It is based on earlier CC BY works and is itself released under a Creative Commons Attribution 4.0 International license allowing reuse and adaptation.", "extraction_method": "html", "text_hash": "14c912e88942e7720d4223bfb8d2abd5", "notes": ""}
{"resource_id": "R005", "url": "https://wisconsin.pressbooks.pub/logicfundamentals/", "extracted_text": "Fundamental Methods of Logic is released under a Creative Commons Attribution 4.0 International license. It introduces students to the study of arguments, validity and soundness.  Topics include informal fallacies, Aristotelian logic, sentential logic, inductive logic and basic probability.  In the chapter \"The Basics of Logical Analysis\" the author explains that logic studies reasoning; good reasoning aims to preserve truth and avoid contradictions, and propositions are statements that can be true or false.", "extraction_method": "html", "text_hash": "db37c5927daa34a99a7e1e7047a048c9", "notes": ""}
{"resource_id": "R006", "url": "https://www.w3.org/2008/Talks/0421-Beijing-IH/Slides.pdf", "extracted_text": "The W3C Semantic Web tutorial introduces the motivation for the Semantic Web and explains how current web content is designed for human consumption rather than machine processing.  It presents scenarios where data from multiple sources must be combined—such as booking travel or integrating scientific data—and shows how the Semantic Web can enable interoperability.  The slides conclude with a notice that the tutorial is made publicly available under a Creative Commons Attribution licence.", "extraction_method": "pdf", "text_hash": "a041cf850bbf3bdd9c83acd6a49c6930", "notes": ""}
{"resource_id": "R007", "url": "https://artint.info/2e/html/ArtInt2e.Ch16.S1.html", "extracted_text": "This section defines a knowledge graph as a set of triples consisting of a subject, predicate and object. It discusses how triples can be reified when we need to make statements about statements and explains representation choices, such as using lists versus objects, and how graphs enable flexible modelling of knowledge.  The page is licensed under a Creative Commons Attribution–NonCommercial–NoDerivatives 4.0 International licence, permitting redistribution for non-commercial purposes provided no derivatives are made.", "extraction_method": "html", "text_hash": "4663a6d5d9196e7748402372b0dbe845", "notes": ""}
{"resource_id": "R008", "url": "https://artint.info/2e/html/ArtInt2e.Ch16.S2.html", "extracted_text": "In this chapter the authors distinguish between primitive and derived knowledge and describe classes and properties.  They illustrate how class hierarchies allow inheritance of properties and why natural kinds should be modeled carefully.  Examples from Wikidata demonstrate how entities can be organized into classes (e.g., humans, athletes) and properties (e.g., sports, birthplace).  The page carries a CC BY–NC–ND 4.0 licence.", "extraction_method": "html", "text_hash": "add54a7f11140894077d276c51525255", "notes": ""}
{"resource_id": "R009", "url": "https://artint.info/2e/html/ArtInt2e.Ch16.S3.html", "extracted_text": "This section examines why building large knowledge bases is challenging and why a shared vocabulary is essential. It introduces the Semantic Web stack: XML for syntax, RDF for triples, RDFS for schema information and OWL for expressing richer constraints.  The authors discuss global ontology development efforts and define a conceptualization as a pair consisting of a universe of discourse and relations of interest.  It is licensed CC BY–NC–ND 4.0.", "extraction_method": "html", "text_hash": "ea43994e3f82690ce76ab8fd15023a1c", "notes": ""}
{"resource_id": "R010", "url": "https://artint.info/html/ArtInt.html#sec14", "extracted_text": "This subsection discusses the physical symbol system hypothesis, stating that a physical symbol system has the necessary and sufficient means for intelligent action.  It distinguishes between the knowledge level, where agents reason about the world, and the symbol level, where knowledge is encoded in a representation.  The authors highlight that representations are a means of describing the world in a way that facilitates reasoning.  The page is distributed under a CC BY–NC–ND 2.5 Canada licence.", "extraction_method": "html", "text_hash": "36d9adc6f1d437911db68639d1048910", "notes": ""}
{"resource_id": "R011", "url": "https://artint.info/2e/html/ArtInt2e.Ch13.S3.html", "extracted_text": "Description logics form the foundation of ontology languages such as OWL.  This section explains that a knowledge base in description logic consists of a terminological knowledge base (TBox) describing classes and a assertional knowledge base (ABox) describing individuals.  It introduces built‑in predicates (e.g., rdf:type, owl:Thing) and class constructors like union, intersection and complement.  Unique names and the open world assumption are highlighted.  The section is licensed under CC BY–NC–ND 4.0.", "extraction_method": "html", "text_hash": "ff822f40ff6a8b7951c2c45ca319c371", "notes": ""}
{"resource_id": "R012", "url": "https://www.lincsproject.ca/linked-open-data/linked-data/", "extracted_text": "Linked data uses Uniform Resource Identifiers (URIs) to unambiguously identify resources and organizes information as triples (subject, predicate, object).  The page explains that triples form graphs which can be queried and reasoned over.  It provides examples of how URIs enable linking between datasets and notes that LINCS uses linked data to expose cultural heritage collections on the web.  The work is licensed under a Creative Commons Attribution 4.0 International License.", "extraction_method": "html", "text_hash": "ade632b28c6b507705676b81ae7605d2", "notes": ""}
{"resource_id": "R013", "url": "https://www.lincsproject.ca/linked-open-data/ontologies/", "extracted_text": "This page defines an ontology as a particular worldview describing entities and their relationships.  It discusses how ontologies help data integration by providing a shared conceptual framework and notes that some ontologies are object‑oriented (focusing on entities) while others are event‑oriented (focusing on processes).  LINCS uses ontologies to align diverse cultural heritage data. The page is released under a CC BY 4.0 licence.", "extraction_method": "html", "text_hash": "8a2c10d367e6ee25c5e1c11b420d896a", "notes": ""}
{"resource_id": "R014", "url": "https://www.lincsproject.ca/linked-open-data/sparql/", "extracted_text": "SPARQL is a query language for RDF data.  The page explains the basic structure of a SPARQL query: prefixes declare namespaces, a query form (ASK, SELECT, CONSTRUCT, DESCRIBE) specifies the shape of the results and a WHERE clause contains triple patterns to match.  Examples illustrate how to retrieve all triples for a resource or to filter results.  The work is licensed under a Creative Commons Attribution 4.0 International License.", "extraction_method": "html", "text_hash": "425e1959124ab595361829829e6a3207", "notes": ""}
{"resource_id": "R015", "url": "https://www.lincsproject.ca/linked-open-data/vocabularies/", "extracted_text": "Vocabularies, taxonomies and thesauri are controlled lists of terms that provide consistency in describing resources.  This page explains the differences: vocabularies are simple lists, taxonomies arrange terms hierarchically and thesauri include synonyms and related terms.  Ontologies extend vocabularies by adding rich semantics.  LINCS uses controlled vocabularies to improve search and discovery.  The page is licensed CC BY 4.0.", "extraction_method": "html", "text_hash": "4c96e625a64012066a55c134af0c9c42", "notes": ""}
{"resource_id": "R016", "url": "https://ocw.mit.edu/courses/6-871-knowledge-based-application-systems-fall-2005/resources/what-is-a-knowledge-representation/", "extracted_text": "These lecture slides explain that a knowledge representation plays several roles: it is a surrogate for the thing itself; it commits to an ontology by making explicit what exists; it can be viewed as a fragment of a theory of intelligent reasoning; it serves as a medium for computationally efficient reasoning; and it provides a language for human expression.  Each role is illustrated with examples.  MIT OpenCourseWare materials are licensed under a Creative Commons Attribution–NonCommercial–ShareAlike 4.0 licence.", "extraction_method": "pdf", "text_hash": "23db1beb660aabc75bad04aa284e05f9", "notes": ""}
{"resource_id": "R017", "url": "https://artint.info/2e/html/ArtInt2e.Ch01.S4.html", "extracted_text": "This section introduces the general framework for knowledge representation in intelligent agents.  It discusses why choosing the right representation is crucial for solving problems and suggests criteria for a good representation: expressiveness, ease of reasoning, and ability to integrate new knowledge.  Examples illustrate how different representations (e.g., logic vs frames) affect problem solving.  It is released under a CC BY–NC–ND 4.0 licence.", "extraction_method": "html", "text_hash": "4cf7a4380b3b3dae58860ef7457409cc", "notes": ""}
