{"resource_id": "R001", "url": "https://ocw.mit.edu/courses/6-036-introduction-to-machine-learning-fall-2020/", "extracted_text": "This course introduces principles, algorithms, and applications of machine learning from the point of view of modeling and prediction. It includes formulation of learning problems and concepts of representation, over‑fitting, and generalization. These concepts are exercised in supervised learning and reinforcement learning, with applications to images and temporal sequences.", "extraction_method": "html", "text_hash": "8d83537eeb3abedb66a2e43d36ce2154f5f5a550a2dcfa81f5fbd5240f5d4cf4", "notes": ""}
{"resource_id": "R002", "url": "https://ocw.mit.edu/courses/6-0002-introduction-to-computational-thinking-and-data-science-fall-2016/", "extracted_text": "6.0002 is the continuation of 6.0001 Introduction to Computer Science and Programming in Python and is intended for students with little or no programming experience. It aims to provide students with an understanding of the role computation can play in solving problems and to help students, regardless of their major, feel justifiably confident of their ability to write small programs that allow them to accomplish useful goals. The class uses the Python 3.5 programming language.", "extraction_method": "html", "text_hash": "db9066b0c0610524218f5d2ef5786ca3fcc40b2551e0fa6a89cef64ccc996864", "notes": ""}
{"resource_id": "R003", "url": "https://ocw.mit.edu/courses/18-065-matrix-methods-in-data-analysis-signal-processing-and-machine-learning-fall-2018/", "extracted_text": "Linear algebra concepts are key for understanding and creating machine learning algorithms, especially as applied to deep learning and neural networks. This course reviews linear algebra with applications to probability and statistics and optimization–and above all a full explanation of deep learning.", "extraction_method": "html", "text_hash": "bf1ffe601f1398fc76fb773672aabbc9500901d4c5ad98239f1f38929cd701f6", "notes": ""}
{"resource_id": "R004", "url": "https://ocw.mit.edu/courses/6-0002-introduction-to-computational-thinking-and-data-science-fall-2016/resources/ps1/", "extracted_text": "This programming assignment provides a zip folder containing one PDF file, two text files and three Python scripts. Students develop code to solve the Space Cows transportation problem.", "extraction_method": "html", "text_hash": "dc5aa3d05b1fc8051d3ca93e2c86270a17c455330277c2a58b16319361b78e5f", "notes": ""}
{"resource_id": "R005", "url": "https://ocw.mit.edu/courses/6-0002-introduction-to-computational-thinking-and-data-science-fall-2016/resources/ps2/", "extracted_text": "This programming assignment provides a zip folder containing one PDF file, one text file and two Python scripts. The task focuses on finding the fastest way to get around MIT using algorithmic approaches.", "extraction_method": "html", "text_hash": "1371dbd78297990160b5aaaed6dcba42de4ec7ccd81e19bdecfd3e8d510f3f18", "notes": ""}
{"resource_id": "R006", "url": "https://ocw.mit.edu/courses/6-0002-introduction-to-computational-thinking-and-data-science-fall-2016/resources/ps3/", "extracted_text": "This programming assignment contains a zip folder with one PDF file, four compiled Python files and four Python scripts. Students simulate robots moving in a defined environment.", "extraction_method": "html", "text_hash": "d5bda48a95c3100e09503b8a72badc4a0ab603d8304ee4fcfe8740653c1d930e", "notes": ""}
{"resource_id": "R007", "url": "https://ocw.mit.edu/courses/6-0002-introduction-to-computational-thinking-and-data-science-fall-2016/resources/ps4/", "extracted_text": "This programming assignment includes a zip folder with one PDF file and two Python scripts. Learners simulate the spread of disease and the growth of a bacteria population.", "extraction_method": "html", "text_hash": "3ca9c1ec784b5b55da52b7a3ce6c49593ccd3b9c99dcca4575685179e033f7af", "notes": ""}
{"resource_id": "R008", "url": "https://datasciencebook.ca/", "extracted_text": "This chapter of the open textbook provides an introduction to data science and the R programming language. It walks through an entire data analysis to get readers hands‑on experience, introducing different types of data analysis question, fundamental programming concepts in R, and the basics of loading, cleaning, and visualizing data. Readers learn to identify types of data analysis questions, load the tidyverse package, read tabular data using read_csv, create new variables and objects in R, subset data frames with filter and select, arrange and slice rows, mutate columns, and visualize data with ggplot bar plots. The chapter explores a dataset of languages spoken at home by Canadian residents to ask which Aboriginal languages are most commonly reported as mother tongues, emphasizing the importance of understanding the data and problem domain and warning that data science cannot be done without domain expertise and awareness of data collection biases.", "extraction_method": "html", "text_hash": "0c02dd8821060baf05652dc90a2fcd61172cefe9d3eb27ca30ecff34571a7e6e", "notes": ""}
{"resource_id": "R009", "url": "https://datacarpentry.org/lessons/", "extracted_text": "Data Carpentry develops domain‑specific lessons for workshops. These lessons are distributed under the CC‑BY license and are free for reuse or adaptation with attribution. Data Carpentry workshops teach researchers the skills most relevant to their domain using examples from their own work. The Astronomy curriculum teaches database operations and creating publication‑quality data visualisations. The Ecology workshop uses a tabular ecology dataset to teach data cleaning, management, analysis and visualization with no prerequisites. Lessons in English for ecology include Data Organization in Spreadsheets, Data Cleaning with OpenRefine, Data Management with SQL, Data Analysis and Visualization in R, and Data Analysis and Visualization in Python.", "extraction_method": "html", "text_hash": "57917309e9d3199cccd1b0502ae447ed956bf417e4e65fc84ab3ae27b64eaccd", "notes": ""}
{"resource_id": "R010", "url": "https://www.fun-mooc.fr/courses/machine-learning-python-scikit-learn/", "extracted_text": "Machine learning in Python with scikit‑learn is a course that builds predictive models using scikit‑learn and provides a practical understanding of machine learning. Learners grasp fundamental concepts, build predictive modeling pipelines, develop intuitions behind models from linear models to gradient‑boosted decision trees, and evaluate model performance. The course offers step‑by‑step lessons that teach learners to be critical about each step of the predictive modeling pipeline, from data preprocessing to model selection and interpretation. It includes practical training through Jupyter notebooks, quizzes and programming exercises. Modules cover the predictive modeling pipeline, selecting the best model, hyperparameter tuning, linear models, decision tree models, ensemble methods and evaluating model performance. The course is accessible without a strong technical background; basic Python knowledge and some experience with NumPy, pandas and Matplotlib are recommended. The MOOC is free and course materials are available online.", "extraction_method": "html", "text_hash": "93d50f0f82f213e28f1794f28d92a83e34850879eb0489559b69f78c24189097", "notes": ""}
{"resource_id": "R011", "url": "https://www.fun-mooc.fr/courses/from-database-to-big-data/", "extracted_text": "The course ‘From data base to big data’ provides a conceptual framework for understanding modern data systems by exploring major standards. A multidisciplinary introduction offers a strategic vision of the future of information systems around the concepts of mobiquity and Big Data. The course presents fundamental concepts of databases and Big Data with their paradigms and properties (TIPS/ACID, RICE, WHAT/BASE, Google CABS) and explores top‑down and bottom‑up approaches to data integration. Intended as a seven‑week course, it includes short video sequences, quizzes, practical work, discussion forums, and peer‑reviewed exercises. Two packages are available: Discovery (free, with videos, quizzes and forums) and Certifying (which adds peer‑reviewed exercises, weekly live tutoring and a monitored exam). Topics cover spiralist innovation on Big Data systems, data paradigms and Codd’s relational model, SQL2, the Third Date’s manifesto for object‑relational models, ODMG, SQL3, and an overview of NoSQL and NewSQL systems.", "extraction_method": "html", "text_hash": "5ff769b671c5fdb265ffd3c2388273f0869cdcf9dcba359053b3d333c2b5e203", "notes": ""}
{"resource_id": "R012", "url": "https://openstax.org/books/introductory-statistics-2e/pages/1-introduction", "extracted_text": "Introductory Statistics 2e introduces the science of collecting, analyzing, interpreting and presenting data. In the section ‘Definitions of Statistics, Probability, and Key Terms’ it explains that statistics is used in everyday life and includes descriptive statistics—organizing and summarizing data using graphs and numbers such as averages—and inferential statistics, which uses probability to draw conclusions from data. A collaborative exercise invites students to record their sleep hours and create a dot plot. The text emphasizes probability as a tool to study randomness and introduces topics such as combinatorics, random variables, probability distributions, Bayesian inference, hypothesis testing, confidence intervals and linear regression.", "extraction_method": "html", "text_hash": "88b0237c538473e128f700c8c81d73f9a561bda4df6fa300972bfce11d1dcf57", "notes": ""}
{"resource_id": "R013", "url": "https://ocw.mit.edu/courses/18-s096-matrix-calculus-for-machine-learning-and-beyond-january-iap-2023/", "extracted_text": "Matrix Calculus for Machine Learning and Beyond teaches matrix calculus as the next step after univariate and vector calculus, focusing on applications in machine learning and large‑scale optimization. Students learn a coherent approach to matrix calculus that encourages thinking of a matrix holistically rather than as an array of scalars. The course covers techniques to generalize and compute derivatives of important matrix factorizations and other complex operations, and explains how differentiation formulas must be reimagined for large‑scale computing. By re‑emphasizing linearization and the linear algebra at the heart of calculus, the class addresses complicated functions like matrix determinants and solutions of differential equations.", "extraction_method": "html", "text_hash": "7630033cbcd26b2e9f22f309a983dee4035c15a4b38904d49525ccc7f621b110", "notes": ""}
{"resource_id": "R014", "url": "https://ocw.mit.edu/courses/6-0001-introduction-to-computer-science-and-programming-in-python-fall-2016/", "extracted_text": "6.0001 Introduction to Computer Science and Programming in Python is intended for students with little or no programming experience. The course provides an understanding of the role computation can play in solving problems and helps students, regardless of their major, feel confident in their ability to write small programs that accomplish useful goals. It uses the Python 3.5 programming language and teaches basic programming concepts and problem‑solving skills.", "extraction_method": "html", "text_hash": "44970bfcd71e5997456c041eccb81b1a406eab1db66e6bf64c5945a5f6fcb392", "notes": ""}
{"resource_id": "R015", "url": "https://www.openintro.org/book/os/", "extracted_text": "OpenIntro Statistics is a dynamic take on the traditional statistics curriculum and is used from community colleges to the Ivy League. Recommended for college courses and self‑study, the resource provides videos, slides, labs and other materials. Free PDF downloads and additional resources are available through the website.", "extraction_method": "html", "text_hash": "ad5146ff5a6d55a82b5364f78d40612a08dd605af595d7f6b75fe9b6818de1a9", "notes": ""}
{"resource_id": "R016", "url": "https://www.openintro.org/book/ims/", "extracted_text": "Introduction to Modern Statistics reimagines the earlier Introduction to Statistics with Randomization and Simulation. It introduces multi‑dimensional thinking early on and emphasizes exploratory data analysis, using visualization, summarization and descriptive models to explore multivariate relationships. The book provides a thorough discussion of simulation‑based inference using randomization and bootstrapping followed by Central Limit Theorem‑based approaches. The second edition adds updated datasets, additional exercises, a new application and updated text and code reflecting best practices. The web‑native book, built with bookdown, offers easy navigation, interactive R tutorials, labs using tidyverse and infer packages, and access to datasets.", "extraction_method": "html", "text_hash": "ef73031dfe0521e95735765e1e8b949750b85243466df0128f485266a99fee61", "notes": ""}
{"resource_id": "R017", "url": "https://datacarpentry.github.io/python-ecology-lesson/", "extracted_text": "Data Analysis and Visualization in Python for Ecologists is an introductory lesson designed for participants with no programming experience. Over about ten hours, learners are taught the basics of Python syntax and the Jupyter notebook interface, importing CSV files, using the pandas package to work with data frames, calculating summary information, and making simple plots. The final lesson demonstrates how to work with databases directly from Python.", "extraction_method": "html", "text_hash": "4eb6cec0b6acd934e269051ef4a31f57e2e527ef97cd3616b46fdbd92ad0dd44", "notes": ""}
{"resource_id": "R018", "url": "https://ocw.mit.edu/courses/18-05-introduction-to-probability-and-statistics-spring-2022/", "extracted_text": "This course provides an elementary introduction to probability and statistics with applications. Topics include basic combinatorics, random variables, probability distributions, Bayesian inference, hypothesis testing, confidence intervals and linear regression. Interactive components such as online reading questions and problem checkers are available through MIT’s Open Learning Library.", "extraction_method": "html", "text_hash": "dc1b4429a962fe22d5528a55837c2ca6a3a4093922b1da562d5aa1865d3f4861", "notes": ""}
