{"resource_id": "R001", "url": "https://ocw.mit.edu/courses/6-005-software-construction-spring-2016/", "extracted_text": "6.005 Software Construction introduces fundamental principles and techniques of software development. Students learn how to write software that is safe from bugs, easy to understand and ready for change. The course includes problem sets and a final project. Important topics include specifications and invariants; testing; abstract data types; design patterns for object-oriented programming; concurrent programming and concurrency; and functional programming. It emphasises writing safe, understandable code and readiness for change, covering specifications, invariants, testing, design patterns, concurrency, functional programming and abstract data types.", "extraction_method": "html", "text_hash": "70ed783959dc2947c13c79b9992f78b482058ae72ecda8f9bc3afb3484ff2c5a", "notes": ""}
{"resource_id": "R002", "url": "https://ocw.mit.edu/courses/1-124j-foundations-of-software-engineering-fall-2000/", "extracted_text": "This foundation subject in modern software development techniques covers the design and development of component‑based software using C# and .NET; data structures and algorithms for modeling, analysis and visualization; basic problem‑solving techniques; web services; and management and maintenance of software. It also treats topics such as sorting and searching algorithms and numerical simulation techniques, providing a foundation for in‑depth exploration of image processing, computational geometry, finite element methods, network methods and e‑business applications.", "extraction_method": "html", "text_hash": "d16887c6edd84a6adc215ed9d65cc35c953dbcc1188e418cbcfaa956c4dc176c", "notes": ""}
{"resource_id": "R003", "url": "https://ocw.mit.edu/courses/6-005-elements-of-software-construction-fall-2008/", "extracted_text": "This course provides an introduction to the fundamental principles and techniques of software development that have the greatest impact on practice. Topics include capturing the essence of a problem by recognizing and inventing suitable abstractions; key paradigms, including state machines, functional programming and object‑oriented programming; the use of design patterns to bridge the gap between models and code; the role of interfaces and specification in achieving modularity and decoupling; reasoning about code using invariants; testing, test‑case generation and coverage; and essentials of programming with objects, functions and abstract types.", "extraction_method": "html", "text_hash": "151fb5b16b58f571f3a718d8a37256d0ede79005c9a3c91a8d0abd4012795edc", "notes": ""}
{"resource_id": "R004", "url": "https://ocw.mit.edu/courses/6-170-laboratory-in-software-engineering-fall-2005/", "extracted_text": "This course introduces concepts and techniques relevant to the production of large software systems. Students are taught a programming method based on the recognition and description of useful abstractions. Topics include modularity, specification, data abstraction, object modeling, design patterns and testing. Students complete several programming projects of varying size, working individually and in groups, to practice these software engineering concepts.", "extraction_method": "html", "text_hash": "e5f9d9680e4e54a5d06b78809c482bfb94a60b55276dfef7a7a249b6983b1df8", "notes": ""}
{"resource_id": "R005", "url": "https://www.fun-mooc.fr/en/courses/reproducible-research-ii-practices-and-tools-for-managing-computations-and-data/", "extracted_text": "Ce cours en ligne sur la recherche reproductible enseigne comment organiser un logiciel et les données pour assurer la reproductibilité et la réplicabilité des résultats scientifiques. Il couvre la gestion des données, la gestion des environnements logiciels avec Conda, l’utilisation de conteneurs comme Docker et Singularity, l’automatisation des flux de travail avec Make, Snakemake ou Nextflow, et la création d’une boîte à outils reproductible. Le cours s’adresse aux chercheurs souhaitant améliorer la reproductibilité de leurs travaux et montre comment déployer des environnements logiciels et gérer la performance et la mise en production des logiciels de recherche.", "extraction_method": "html", "text_hash": "b9ae59dd713d499f0ca8fface55837345ee93b5fec65bf69b67699ee74bf7b22", "notes": ""}
{"resource_id": "R006", "url": "https://open.oregonstate.education/software-methods/", "extracted_text": "The Handbook of Software Engineering Methods defines software engineering as the systematic application of scientific and technological knowledge to the design, implementation, testing and documentation of software. It introduces agile methods, project management practices and requirements engineering, discusses how to use UML, compares monolithic and microservice architectures, and includes chapters on paper prototyping, inclusivity heuristics and identifying code smells. The textbook helps readers develop structured software engineering practices and is licensed under a Creative Commons Attribution‑NonCommercial 4.0 International licence.", "extraction_method": "html", "text_hash": "adeb6008d71172097f43b910db9aa184f8ee54327f19afa3638e5297c8e1d4b3", "notes": ""}
{"resource_id": "R007", "url": "https://rse‑book.github.io/", "extracted_text": "The Research Software Engineering book provides an overview of the open source ecosystem and explores tools for version control, continuous integration, automation, data management, licensing, testing and packaging. It aims to help research software engineers develop best practices for reproducible and sustainable research software. The book is freely available online thanks to the publisher and is licensed under a Creative Commons Attribution‑NonCommercial‑ShareAlike licence.", "extraction_method": "html", "text_hash": "98b60cc46dce8ec36c3a1e78c6e124a2126b191a943848100bff14bff0576506", "notes": ""}
{"resource_id": "R008", "url": "https://textbooks.cs.ksu.edu/cis642/intro.html", "extracted_text": "This open textbook for the CIS 642/643 Software Engineering course at Kansas State University covers the history of software development, the waterfall model, requirements gathering, design methodologies, agile models, implementation and testing. It also discusses configuration management, architecture and patterns, object‑oriented programming, security, and maintenance. The work is licensed under a Creative Commons Attribution‑NonCommercial‑ShareAlike 4.0 licence and includes assignments and exercises to reinforce the concepts.", "extraction_method": "html", "text_hash": "5ac80333775c83c4040d59404b975f617f2f8748dbc32b187fedd52f6a638a7f", "notes": ""}
{"resource_id": "R009", "url": "https://openbooks.library.unt.edu/software-engineering-workbook/", "extracted_text": "The Software Engineering Workbook for Team Projects is designed for early‑career software engineers working on collaborative projects. It includes chapters on team building, risk planning, setting up development environments, coding standards, usability, validation testing, preparing demos, peer reviews and evaluations. The workbook helps teams plan, design, implement and refine software projects and is licensed under a Creative Commons Attribution‑NonCommercial 4.0 International licence.", "extraction_method": "html", "text_hash": "bd3f47c8b81efff6b737838fda870c96d2bef1f0e94b9d40a6ac294b589af8a0", "notes": ""}
{"resource_id": "R010", "url": "https://learn.saylor.org/course/view.php?id=9", "extracted_text": "Saylor Academy’s CS302 Software Engineering course presents software engineering as a body of knowledge. It introduces the concept of software engineering, defines the software development life cycle framework and its major methodologies, and teaches software modeling using the Unified Modeling Language (UML). Students learn about the SDLC phases of analysis, design, coding and testing, as well as project management techniques to deliver reliable software that meets customer needs and stays within budget. The course emphasises processes and methodologies and is offered under a Creative Commons Attribution 3.0 licence.", "extraction_method": "html", "text_hash": "4c0a43a65c5dac455bf0698b537e39225579f03c8de04a5718f3e8e749ec624a", "notes": ""}
{"resource_id": "R011", "url": "https://khatchad.commons.gc.cuny.edu/teaching/csci-40500-77100-software-engineering-sp-21/syllabus/", "extracted_text": "The syllabus for CSCI 40500/77100: Software Engineering at Hunter College surveys fundamental concepts and principles that underlie current and emerging methods, tools and techniques for engineering high‑quality software systems. It covers functional analysis of information processing systems, system design concepts, timing estimates, documentation, system testing, software project management, development processes, requirements elicitation and documentation, reviews and inspections, software evolution, dependable systems and configuration management. The content is licensed under a Creative Commons Attribution‑NonCommercial‑ShareAlike 4.0 licence.", "extraction_method": "html", "text_hash": "4679eea422ea21c4df277a75f7c1396cafb5472adc04b13e2fa40b3a85ae961c", "notes": ""}
{"resource_id": "R012", "url": "https://rebelsky.cs.grinnell.edu/Courses/CSC321/2018S/home/syllabus", "extracted_text": "The Software Design Principles and Practices course (CSC 321) syllabus at Grinnell College provides a foundation for programming in the large and developing high‑quality software. The official course description notes that the course covers the software lifecycle, agile development methods, professional tools and software design principles, and includes hands‑on laboratory work. Offered in a flipped classroom format using MOOCs and online materials, the course aims to help students apply agile methodology and contrast it with plan‑and‑document approaches, build SaaS applications with Ruby on Rails and understand techniques for working with legacy code. The site is licensed under a Creative Commons Attribution‑NonCommercial 3.0 licence.", "extraction_method": "html", "text_hash": "49913ac8a4738fcd13cb4a2f35b27b0bcdcc9dcaccbfc59edcc092c0cddda3ec", "notes": ""}
{"resource_id": "R013", "url": "https://soft-eng-practicum.github.io/softdev2-resources/", "extracted_text": "Intermediate Agile Software Development is a collection of lectures, workshops, assignments and instructor materials for teaching software engineering at an intermediate level. It assumes that students already know basic software engineering terms and skills. Topics include web basics, version control with Git, front‑end frameworks such as Angular and React, JAMstack and back‑end development, security of software, DevOps workshops on Docker and Azure, testing with Selenium, project design and management phases, and instructor materials such as schedules and syllabi. The materials are used in the Software Development II course (ITEC 3870) at Georgia Gwinnett College and are licensed under a Creative Commons Attribution‑ShareAlike 4.0 licence.", "extraction_method": "html", "text_hash": "c202feab8560284627ac72aab5de528e1ccf0d681455bb9e812400ed1e4b016e", "notes": ""}
{"resource_id": "R014", "url": "https://faculty.washington.edu/ajko/books/cooperative-software-development/", "extracted_text": "Cooperative Software Development is a book that focuses on the human, social and organizational aspects of software engineering. Rather than centering technical questions, it explores how software engineering work is cognitive, social and organizational, engaging extensively with academic research literature. Chapters include history, organizations, communication, productivity, quality, requirements, architecture, specifications, process, comprehension, verification, monitoring, evolution and debugging. The book encourages readers to critically engage in creating software in teams and is licensed under a Creative Commons Attribution‑NoDerivatives 4.0 licence.", "extraction_method": "html", "text_hash": "e31a876f9959f9ecb8a9f292c7f01aeedb1afa1041e6029de4dbb448e2a59042", "notes": ""}
{"resource_id": "R015", "url": "https://openstax.org/books/introduction-computer-science/pages/9-1-software-engineering-fundamentals", "extracted_text": "The Introduction to Computer Science textbook from OpenStax includes a section on software engineering fundamentals. The preface explains that the book is designed to increase student access to high‑quality, peer‑reviewed learning materials and is licensed under a Creative Commons Attribution 4.0 International licence. The text provides a comprehensive foundation in core computer science concepts, including chapters on problem solving, algorithms, computational thinking, adaptive design reuse, evolving architectures into usable products, data structures, algorithmic paradigms and software engineering fundamentals. When redistributed in digital format, the licence requires the attribution ‘Access for free at openstax.org’ on every page.", "extraction_method": "html", "text_hash": "c98510f199fea7b578d8b73acc2f01519f9c1449fe957225f961b4cb0248f4b9", "notes": ""}
