{"resource_id": "R001", "url": "https://openlearninglibrary.mit.edu/assets/courseware/v1/94737105f0d37a37e64f6b2e5b1e2e1e/asset-v1:MITx+6.042J+2019_T1+type@asset+block/Notes-chapter5.pdf", "extracted_text": "Graph theory studies structures made of vertices and edges. A graph is defined as a set of vertices and a set of edges that pair these vertices. If no multiple edges or loops are allowed, the graph is called a simple graph. The degree of a vertex is the number of edges incident to it. A complete graph on n vertices has an edge between every pair of vertices, whereas an empty graph has no edges. Cycles are closed paths that begin and end at the same vertex without repeating edges, and line graphs represent edges of an original graph as vertices in a new graph. These ideas form the foundation for more advanced topics such as paths, connectivity and special classes of graphs.", "extraction_method": "html", "text_hash": "2dcef1531d7db44cac758ef8b11bb329f9353f85270687ce73ceb2ea04872381", "notes": "Summary of MIT graph theory chapter; extracted from PDF definitions of graph, simple graph, degree, complete graph and cycles."}
{"resource_id": "R002", "url": "https://openstax.org/books/contemporary-mathematics/pages/7-1-the-multiplication-rule-for-counting", "extracted_text": "The multiplication rule for counting is used to determine the number of ways to perform a sequence of tasks by multiplying the number of choices at each stage. If you choose a cupcake frosting, filling and topping, the total number of cupcakes you can make is the product of the number of options for each component. This rule can be extended to more complex situations such as counting lottery combinations or card hands by treating each selection as a stage and multiplying the available choices. Because repeating items is often not allowed, factorial expressions help simplify calculations.", "extraction_method": "html", "text_hash": "59aa614427034e60fd94e79acd215c500a2e6f0648b67609e8b527037462ea6d", "notes": "Summary of OpenStax section on multiplication rule; covers definition, examples with cupcakes and lottery cards."}
{"resource_id": "R003", "url": "https://openstax.org/books/contemporary-mathematics/pages/7-2-permutations", "extracted_text": "A permutation is an ordered list of objects selected without repetition. The multiplication rule for counting can be used to enumerate permutations by multiplying the number of choices at each position. For n distinct objects taken r at a time, the number of permutations is n!/(n−r)!. This section explains how to simplify factorial expressions and apply them to problems. For example, the number of ways medals can be awarded to the first, second and third place swimmers in an Olympic event is a permutation because the order of finish matters.", "extraction_method": "html", "text_hash": "3b3204b7cd73c055ae0c8b94b28622f7052341299ea478d2cdb61c41f8936a76", "notes": "Summary of OpenStax permutations section; defines permutations, uses factorial formula and provides medal example."}
{"resource_id": "R004", "url": "https://openstax.org/books/contemporary-mathematics/pages/7-3-combinations", "extracted_text": "Combinations count the number of ways to select objects when order does not matter. Unlike permutations, where the arrangement of items is important, combinations focus solely on the subset itself. The formula for combinations, nCr = n!/(r!(n−r)!), divides by r! to remove duplicate orderings. This concept is used to count hands of playing cards or committees where the order of members is irrelevant. The section highlights how to identify when a problem requires permutations versus combinations and illustrates the difference with examples.", "extraction_method": "html", "text_hash": "e50605aa825102b7860c0a58ebfc0913cff923df74533c12c67b901d2bf2656b", "notes": "Summary of combinations section; distinguishes between permutations and combinations, provides formula and examples."}
{"resource_id": "R005", "url": "https://openstax.org/books/contemporary-mathematics/pages/7-4-tree-diagrams-tables-and-outcomes", "extracted_text": "Listing the possible outcomes of an experiment defines its sample space. When experiments have several stages, tree diagrams and tables help organize the sample space. A sample space contains every possible result of an experiment, such as heads and tails for a coin flip or the six faces of a die. Tree diagrams visualize multi‑stage experiments by branching outcomes at each stage, while tables arrange outcomes in a grid. These tools make it easier to identify all possibilities before calculating probabilities or making decisions.", "extraction_method": "html", "text_hash": "06545cf8e3a375b49132c4577e89ed6e8985bca4fa6c7e04abd089a6b679c69b", "notes": "Summary of tree diagrams section; explains sample spaces, use of tables and tree diagrams to list outcomes."}
{"resource_id": "R006", "url": "https://openstax.org/books/contemporary-mathematics/pages/7-6-probability-with-permutations-and-combinations", "extracted_text": "When experiments involve many possible outcomes, listing the entire sample space can be impractical. This section uses permutations and combinations to compute probabilities without writing out every outcome. By counting the number of favorable arrangements and the total arrangements with counting techniques, one can calculate probabilities of events in games and real‑world contexts. Examples include determining the probability that a randomly selected set of officers consists of certain members or computing the likelihood that a specific order of horses wins a race.", "extraction_method": "html", "text_hash": "ea05b777c065cc717756bdba218b5ccde3155cf1b038fb359204720b570b90bf", "notes": "Summary of probability with permutations and combinations; describes using counting techniques to compute probabilities."}
{"resource_id": "R007", "url": "https://openstax.org/books/contemporary-mathematics/pages/7-7-what-are-the-odds", "extracted_text": "Odds express the ratio of the number of favorable outcomes to the number of unfavorable outcomes. While probability measures the chance that an event occurs, odds compare the number of ways an event can occur to the number of ways it cannot. For example, if a lottery has 500,000 winning tickets out of 2 million tickets, the odds of winning are 500,000 to 1,500,000. The section defines odds for an event as P(E)/P(E'), where P(E') is the probability of the complement. It also explains odds against an event and clarifies the difference between odds and probabilities.", "extraction_method": "html", "text_hash": "45062ec08b62d0a2fba43f69acdaadf5d57ae38bd2e3965fd6cd438e8ea91a60", "notes": "Summary of odds section; defines odds, distinguishes from probability, provides lottery example."}
{"resource_id": "R008", "url": "https://openstax.org/books/contemporary-mathematics/pages/12-1-graph-basics", "extracted_text": "Graph theory begins with vertices (points) and edges (lines) connecting pairs of vertices. A simple graph has no loops or multiple edges, while a multigraph allows multiple edges between the same vertices. Vertices connected by an edge are called adjacent and the number of edges incident to a vertex is its degree. Graphs can be represented visually or with lists of vertices and edges. Understanding basic terms such as loops, parallel edges and degrees is essential before exploring more complex structures.", "extraction_method": "html", "text_hash": "85f5ac2c73573333715509f9f305fbaa59286e3b727ddc433d683d12ae57b1e1", "notes": "Summary of graph basics; defines vertices, edges, simple graphs, multigraphs, adjacency and degrees."}
{"resource_id": "R009", "url": "https://openstax.org/books/contemporary-mathematics/pages/12-2-graph-structures", "extracted_text": "This section explores how graphs model relationships in fields like neuroscience and sociology. Graphs represent networks where vertices correspond to components such as brain regions and edges represent functional connections. Learning objectives include describing relationships and modeling them with graphs. Researchers study the degrees of vertices to understand network resilience; graphs with many edges tend to be more resistant to failures. Example 12.6 compares three graphs to determine which network is most resilient and invites readers to consider sums of degrees in different communities. The section also relates the number of edges in a graph to the degrees of its vertices.", "extraction_method": "html", "text_hash": "aa7981633bc36adf805eadd9fb95c28315241233533b3e96daefa3a10339339a", "notes": "Summary of graph structures section; discusses modeling relationships in neuroscience and sociology, degree and resilience, and sums of degrees."}
{"resource_id": "R010", "url": "https://openstax.org/books/contemporary-mathematics/pages/12-3-comparing-graphs", "extracted_text": "Graphs can look different yet represent the same relationships. This section teaches how to compare graphs and determine when they are isomorphic. Two graphs are considered the same if their vertices can be paired so that adjacent vertices remain adjacent after relabeling or transforming the graph. Learning objectives include identifying characteristics used to compare graphs, determining when two graphs represent the same relationships, exploring real‑world examples of graph isomorphisms and finding graph complements. The section uses maps of Earth drawn on flat and spherical surfaces to illustrate that different representations can be isomorphic. It also states conditions under which graphs cannot be isomorphic, such as having unequal numbers of vertices or edges.", "extraction_method": "html", "text_hash": "f939ecea44ef18ae1f447eeece4c998064381976bbd8467c5b945f896be70370", "notes": "Summary of comparing graphs; defines isomorphic graphs, explains how to determine when graphs are the same and provides conditions for non‑isomorphism."}
{"resource_id": "R011", "url": "https://openstax.org/books/contemporary-mathematics/pages/12-4-navigating-graphs", "extracted_text": "Once you can distinguish graphs, you can use them to solve navigation problems. This section introduces walks, trails, paths and circuits—sequences of vertices and edges that follow different rules. Learning objectives include describing these sequences, solving application problems with them and identifying chromatic numbers and graph colorings. The section likens navigating through a maze to traversing a graph and explains that a walk is any sequence of adjacent vertices and edges, even if vertices or edges repeat. Naming a walk involves listing the vertices or edges in order. It also describes how graph theory can guide you through a maze more efficiently than random wandering.", "extraction_method": "html", "text_hash": "00bcaa09dfb5abf695f414b03e3f41026b1aa866a0e2e627c2b059fc38061820", "notes": "Summary of navigating graphs; explains walks, trails, paths, circuits, chromatic numbers, and maze navigation analogy."}
{"resource_id": "R012", "url": "https://openstax.org/books/contemporary-mathematics/pages/12-5-euler-circuits", "extracted_text": "Euler circuits are paths that start and end at the same vertex while using every edge exactly once. Before finding such circuits, one must ensure the graph is connected. The section’s learning objectives include determining if a graph is connected, stating the Chinese postman problem, identifying Euler circuits, applying the Euler circuits theorem and eulerizing graphs to solve real‑world delivery problems. A motivating example discusses how delivery services plan efficient routes by representing locations and roads as vertices and edges. The section explains that a connected graph has a path joining every pair of vertices, and gives examples of connected versus disconnected graphs.", "extraction_method": "html", "text_hash": "f5617ff0473efd2c37b75892129d8cd0e8ccfc6ac4f9832e1851c931c9d1cdb8", "notes": "Summary of Euler circuits section; defines Euler circuits, explains connected graphs, Chinese postman problem and applications to delivery routes."}
{"resource_id": "R013", "url": "https://courses.lumenlearning.com/waymaker-psychology/chapter/problem-solving/", "extracted_text": "Problem solving involves identifying a problem and applying strategies to find a solution. Everyday problems range from doubling a recipe to meeting a deadline when your printer fails. The section describes different strategies: trial and error tries various solutions until one works; algorithms are step‑by‑step formulas that guarantee a result; and heuristics are general frameworks or mental shortcuts that save time but may not always produce the best answer. Heuristics are useful when there is too much information, little time or insufficient data. Working backwards is a heuristic where you start from the desired goal and plan backwards. Breaking large tasks into smaller steps is another heuristic that makes complex tasks more manageable. The section also discusses puzzles such as Sudoku and connecting dots as ways to practice problem‑solving skills.", "extraction_method": "html", "text_hash": "10cf88a057ead46b8463a4ba08d0d64afb13d482852291b7c5172c64154ad9f9", "notes": "Summary of Lumen problem solving section; covers trial and error, algorithms, heuristics, working backwards and breaking tasks into smaller steps."}
{"resource_id": "R014", "url": "https://openstax.org/books/contemporary-mathematics/pages/12-introduction", "extracted_text": "The introduction to Chapter 12 explains that graph theory studies graphs, which are simplified maps focusing on connections rather than distance or size. Graphs are used to model networks in many fields: Ptolemy used maps for astrological predictions, neurobiologists map the cerebral cortex to understand the brain and social network analysts map online interactions. Unlike geographic maps, graphs ignore details like shape and distance so that the relationships between objects stand out. This chapter outlines basic skills needed to work with graphs.", "extraction_method": "html", "text_hash": "1e22308efc7066fcede61e015c030dd436932a4a7ac70fe06dbf3f205eff57fb", "notes": "Summary of chapter introduction; emphasizes graphs as simplified maps of connections and mentions applications in history, neuroscience and social networks."}
{"resource_id": "R015", "url": "https://openstax.org/books/contemporary-mathematics/pages/7-key-concepts", "extracted_text": "This summary lists the key ideas from each section of Chapter 7. The multiplication rule for counting counts large sets by multiplying the number of choices for each stage. The permutations section emphasizes using the multiplication rule and factorials to count ordered arrangements. The combinations section notes that permutations count subsets when order matters, while combinations count when order does not. The tree diagrams section explains that experiments have sample spaces containing all possible outcomes; tables and tree diagrams organize and visualize these spaces. The probability section distinguishes theoretical, empirical and subjective probabilities and explains how to compute complements. Probability with permutations and combinations uses counting techniques to find probabilities when the sample space is large. The odds section defines odds as the ratio of the probability of an event to that of its complement. Later sections introduce the addition rule for probability, conditional probability, the binomial distribution and expected value, which concerns the long‑term average outcome of repeated experiments.", "extraction_method": "html", "text_hash": "3d6a3e3a3bd716c4221234f424721396a930523461c434c4f3d27496aa0d5226", "notes": "Summary of Chapter 7 key concepts; outlines major ideas from multiplication rule, permutations, combinations, tree diagrams, probability, odds, addition rule, conditional probability, binomial distribution and expected value."}
