{"resource_id": "R001", "url": "https://ocw.mit.edu/courses/1-124j-foundations-of-software-engineering-fall-2000/", "extracted_text": "This course provides a foundation in modern software development techniques for engineering and information technology. It covers the design and development of component‑based software using C# and the .NET framework; data structures and algorithms for modelling, analysis and visualization; basic problem‑solving techniques; web services; and the management and maintenance of software. The course includes topics such as sorting and searching algorithms and numerical simulation techniques and provides a foundation for in‑depth exploration of image processing, computational geometry, finite element methods, network methods and e‑business applications.", "extraction_method": "html", "text_hash": "9ea770dadb2e18173a5c85b9ece54dd1e55d10c911368c254dcf643a5be324da", "notes": ""}
{"resource_id": "R002", "url": "https://ocw.mit.edu/courses/6-171-software-engineering-for-web-applications-fall-2003/", "extracted_text": "Software Engineering for Web Applications gives students with prior programming experience an opportunity to tackle challenges unique to Internet applications. The course focuses on concurrency, unpredictable load, security risks and the opportunities and complications of wide‑area distributed computing. Students learn to create reliable, stateful user experiences on unreliable connections and stateless protocols, deal with extreme requirements and tight development schedules, and adapt to requirements that change mid‑way through a project based on user testing.", "extraction_method": "html", "text_hash": "3fa43124b8ee06fbb96eec15c56fc406f3074987c74d75d5f1c550fe7c911283", "notes": ""}
{"resource_id": "R003", "url": "https://ocw.mit.edu/courses/16-355j-software-engineering-concepts-fall-2005/", "extracted_text": "Software Engineering Concepts is a reading and discussion subject on issues in the engineering of software systems and software development project design. It discusses the present state of software engineering, what has been tried in the past, what worked and what did not, and why. Topics include the software process and lifecycle; requirements and specifications; design principles; testing, formal analysis and reviews; quality management and assessment; product and process metrics; commercial off‑the‑shelf components (COTS) and reuse; evolution and maintenance; team organization and people management; and the effects of programming languages on software engineering.", "extraction_method": "html", "text_hash": "8c574adb9524fb931d3140f57e895b9940655ec3ea6b01f16cedae0c6664858b", "notes": ""}
{"resource_id": "R004", "url": "https://ocw.mit.edu/courses/6-170-laboratory-in-software-engineering-fall-2005/", "extracted_text": "Laboratory in Software Engineering introduces concepts and techniques relevant to the production of large software systems. Students are taught a programming method based on the recognition and description of useful abstractions. Topics include modularity, specification, data abstraction, object modelling, design patterns and testing. Students complete programming projects of varying size, working individually and in groups, to practise these concepts.", "extraction_method": "html", "text_hash": "fcb94f4ae27006996f7860876d7d690a182f08b206d9f02a99bfee881fed9b42", "notes": ""}
{"resource_id": "R005", "url": "https://ocw.mit.edu/courses/6-172-performance-engineering-of-software-systems-fall-2018/", "extracted_text": "Performance Engineering of Software Systems is an 18‑unit class providing a hands‑on, project‑based introduction to building scalable and high‑performance software systems. Topics include performance analysis, algorithmic techniques for high performance, instruction‑level optimizations, caching optimizations, parallel programming and building scalable systems. Students write programs in C and analyse them to improve performance.", "extraction_method": "html", "text_hash": "0a58ab34075e5ae12850ffe0c89561a80361d255248fd14757ffa67efc3dbd7d", "notes": ""}
{"resource_id": "R006", "url": "https://ocw.mit.edu/courses/6-005-software-construction-spring-2016/", "extracted_text": "Software Construction introduces fundamental principles and techniques of software development: writing software that is safe from bugs, easy to understand and ready for change. The course includes problem sets and a final project. Important topics include specifications and invariants, testing, abstract data types, design patterns for object‑oriented programming, concurrent programming and functional programming.", "extraction_method": "html", "text_hash": "e52d248565471facf6bfe85d2c3d1a788d260700c8a62f49087be43220b2fde2", "notes": ""}
{"resource_id": "R007", "url": "https://ocw.mit.edu/ans7870/6/6.005/s16/", "extracted_text": "The 6.005 Software Construction site provides links to readings, general information and problem sets for the Spring 2016 course. Readings cover topics such as static checking, basic Java, testing, code review, version control, specifications, designing specifications, avoiding debugging, mutability and immutability, recursion, debugging, abstract data types, abstraction functions and representation invariants, interfaces, recursive data types, regular expressions and grammars, parser generators, concurrency, thread safety, sockets and networking, queues and message‑passing, graphical user interfaces, map–filter–reduce and team version control. The site also lists problem sets such as Turtle Graphics, Tweet Tweet, Poetic Walks, Expressivo and Multiplayer Minesweeper, a project (ABC Music Player), and quizzes with solutions.", "extraction_method": "html", "text_hash": "f82a9d76e02f30a528437ded1906e7eb5f0d537a4e610ef16c35890e6de3fa6a", "notes": ""}
{"resource_id": "R008", "url": "https://ocw.mit.edu/courses/6-172-performance-engineering-of-software-systems-fall-2018/pages/quizzes/", "extracted_text": "The Performance Engineering of Software Systems course provides practice quizzes and solutions as supplementary resources. The quizzes include practice quizzes 1 through 4 in PDF format, with solutions available for most.", "extraction_method": "html", "text_hash": "a391550e389ffcebdca3ea1d02c65b7b440d7aa4cd6767e8878daa5cc8e41cb7", "notes": ""}
{"resource_id": "R009", "url": "https://openstax.org/books/introduction-computer-science/pages/9-1-software-engineering-fundamentals", "extracted_text": "The Software Engineering Fundamentals section of OpenStax’s Introduction to Computer Science defines software engineering as a systematic, disciplined and quantifiable approach to the development, operation and maintenance of software. It discusses categories of software, such as system software, application software and embedded systems, and emphasises that software engineers must select and tailor processes and methods appropriate to each project. The section lists learning objectives, explains the role of a software engineer on a team and the skills needed, including problem‑solving, knowledge of data structures and programming languages and familiarity with software engineering processes.", "extraction_method": "html", "text_hash": "87f27543d572397213d3486698b9820010747a8430749809e88c612860134d8c", "notes": ""}
{"resource_id": "R010", "url": "https://openstax.org/books/introduction-computer-science/pages/9-2-software-engineering-process", "extracted_text": "The Software Engineering Process section introduces the software development life cycle and describes the phases of inception, elaboration, construction and deployment. It outlines generic framework activities—planning, analysis, design, implementation, testing and deployment—and the umbrella activities of project management, quality assurance, configuration management and risk management. The section compares traditional prescriptive process models, such as the waterfall model, with iterative and Agile process models, and emphasises that the process should be tailored to the needs of the project.", "extraction_method": "html", "text_hash": "046fd46f38d5fd24f76ccd1ea49fdb3d33b7dbe04ce6bb19b57d643ef56dad9e", "notes": ""}
{"resource_id": "R011", "url": "https://openstax.org/books/introduction-computer-science/pages/9-3-special-topics", "extracted_text": "The Special Topics section covers testing, refactoring, design patterns, software tools, software reuse and professional ethics in software engineering. It describes different levels of testing—unit, integration and system testing—and testing methodologies such as white‑box, black‑box and grey‑box testing. The section highlights the importance of testing, discusses stress, performance and security testing, introduces refactoring and common design patterns, explains how tools improve productivity and maintainability and emphasises ethical considerations and the need for security and privacy.", "extraction_method": "html", "text_hash": "4cb8984bc2040dd7c6703645569e9851c3626baaa4140d08a1460a136b095a84", "notes": ""}
{"resource_id": "R012", "url": "https://openstax.org/books/introduction-computer-science/pages/9-4-review-questions", "extracted_text": "The Review Questions page for Chapter 9 provides questions to test understanding of software engineering concepts. Questions ask students to identify best practices in the software engineering process, distinguish between functional and nonfunctional requirements, explain roles on a software engineering team, differentiate among software categories and compare software development life cycle models.", "extraction_method": "html", "text_hash": "34f6eb96439d6043078c7722e11fbb63d969ec2703c750293da2ddce4e513a26", "notes": ""}
{"resource_id": "R013", "url": "https://openstax.org/books/introduction-computer-science/pages/9-4-practice-exercises", "extracted_text": "The Practice Exercises section offers tasks such as listing technology areas and soft skills required for software engineers, categorising software types, selecting an appropriate software development life cycle model for a given scenario, summarising DevSecOps and other development processes and analysing the roles of requirements engineering, search‑based software engineering and test‑driven development.", "extraction_method": "html", "text_hash": "b28db9fc98832b184c715836da760f903285a1297df4fd2c5877efbbf11e4fbb", "notes": ""}
{"resource_id": "R014", "url": "https://openstax.org/books/introduction-computer-science/pages/9-4-problem-set-a", "extracted_text": "Problem Set A poses questions that require listing functional and nonfunctional requirements for a mobile application, prioritising requirements for a scientific calculator program, researching scaled Agile frameworks, explaining why Agile is well suited to emerging technologies and considering ethical scenarios involving the design of an app that tests a food delivery service.", "extraction_method": "html", "text_hash": "6d9748924ca5681ed901a32a9c0e9af9d9dc61fc01b9a40dd8700899482cd2bf", "notes": ""}
{"resource_id": "R015", "url": "https://openstax.org/books/introduction-computer-science/pages/9-5-summary", "extracted_text": "The Chapter 9 Summary synthesises the main ideas from Sections 9.1 through 9.3. It reminds readers that software can be categorised into system, application and embedded software; describes generic process frameworks and umbrella activities; compares traditional and Agile process models; and underscores the importance of testing, refactoring, design patterns, reuse and ethics.", "extraction_method": "html", "text_hash": "7148481b3287166e8dc179d892805643c6183cf901352db2f2f0f7df615f5911", "notes": ""}
{"resource_id": "R016", "url": "https://openstax.org/books/introduction-computer-science/pages/10-4-labs", "extracted_text": "The Labs page for Chapter 10 suggests hands‑on activities: creating a catalogue of design patterns for a selected API or framework; investigating criteria used by service providers such as Azure and AWS to build blueprints for frameworks like Flask, Django or React; using the Essential EA tool to explore solution architecture management and solution modelling; and exploring integrated development environment tools that offer round‑trip engineering capabilities.", "extraction_method": "html", "text_hash": "8c2e998c8344126c6a8166ec7b1a036e39e84ef7b3f1a2abb7651f9b6eee4db1", "notes": ""}
{"resource_id": "R017", "url": "https://openstax.org/books/introduction-computer-science/pages/10-3-solution-architecture-management", "extracted_text": "The Solution Architecture Management section explains how solution architecture bridges enterprise architecture and software engineering. It highlights the solution architect’s role in designing and managing complex systems, ensuring that hardware and software components integrate and align with enterprise goals. The section discusses learning objectives, industry examples (including health care), process patterns and the integration of solution architecture with software engineering activities. It emphasises that solution architecture management involves principles and governance as well as tangible components.", "extraction_method": "html", "text_hash": "567ec066afeff6cdb2277ab727231948b480e2c1dd181cc9adedf6a3afe3475c", "notes": ""}
{"resource_id": "R018", "url": "https://courses.lumenlearning.com/sanjacinto-computerapps/chapter/reading-software-development-process/", "extracted_text": "This reading introduces the concept of a software development methodology or software process, defined as a division of software development work into distinct phases to improve planning and management. It describes common methodologies—including waterfall, prototyping, iterative and incremental development, spiral development, rapid application development, extreme programming and Agile methods—and notes that one framework does not fit all projects. The article explains that software development methodologies evolved to standardise processes and improve quality, discusses the role of project management and Software Engineering Process Groups, traces the history of methodologies from structured programming to Agile, and outlines the phases of the traditional waterfall development model (requirements analysis, design, implementation, testing, integration, deployment and maintenance).", "extraction_method": "html", "text_hash": "41a4225c25df31fdea58031f0473e778479b0e02802af99a572687dcd2d3ea1a", "notes": ""}
