{"resource_id": "R001", "url": "https://ocw.mit.edu/courses/6-824-distributed-computer-systems-engineering-spring-2006/", "extracted_text": "This MIT OpenCourseWare course covers abstractions and implementation techniques for designing distributed systems. The description notes that students study server design, network programming, naming and storage systems, and security and fault tolerance. Readings are drawn from current literature. The course emphasizes that distributed systems require careful design to handle concurrency, communication, and reliability.", "extraction_method": "html", "text_hash": "b905c121aeca3e46cf25a8ec5042f28a27296232478626b790991fc91b108754", "notes": ""}
{"resource_id": "R002", "url": "https://ocw.mit.edu/courses/6-824-distributed-computer-systems-engineering-spring-2006/resources/lecture-notes/", "extracted_text": "The lecture notes page for MIT’s distributed systems course lists a series of handouts and example programs. Topics include concurrency and events, network file systems (NFS), remote procedure calls (RPC), crash recovery, logging, caching, memory management, vector clocks, two‑phase commit, Paxos, and other distributed protocols. Each PDF handout contains lecture slides that explore the theory and practice of building reliable distributed systems, including event‑driven programming, consistency models and scalable storage.", "extraction_method": "html", "text_hash": "9b719c19b688d0561aa067de0912fe75e348aae29d42453c21e0ee4cecf2e651", "notes": ""}
{"resource_id": "R003", "url": "https://ocw.tudelft.nl/courses/modern-distributed-systems/", "extracted_text": "The TU Delft course on Modern Distributed Systems introduces the essential functional and non‑functional concerns of distributed computing. The overview explains that distributed systems are the backbone of modern society and discusses cloud, edge and big data processing. Learners explore architectures and techniques to address performance, resilience and scalability. The course highlights challenges such as consistency, availability, elasticity and scalability, and uses current industrial examples to illustrate how cloud and serverless applications, big data and graph processing, interactive games and online services are built. Students are assessed through quizzes, design exercises and a final project in which they design a distributed system, describing its functional and non‑functional properties.", "extraction_method": "html", "text_hash": "1aeed37eab92f51a9bf87046dc928e621bbeca719f25a5c7bc3e8079d7dd694c", "notes": ""}
{"resource_id": "R004", "url": "https://ocw.mit.edu/courses/6-033-computer-system-engineering-spring-2018/resources/lecture-14-fault-tolerance/", "extracted_text": "The outline for Lecture 14 in MIT’s Computer System Engineering course introduces fault‑tolerant design. Students learn to build reliable systems by identifying types of faults and using detection and containment mechanisms. The lecture discusses fail‑fast, fail‑stop and fault masking approaches and describes trade‑offs between replication, performance and cost. Reliability metrics such as mean time to failure, mean time to repair and availability are defined, and the need for replication to improve reliability is highlighted. Examples include redundant arrays of independent disks (RAID 1, RAID 4 and RAID 5), which store data across multiple disks to offer fault tolerance and increased read performance.", "extraction_method": "html", "text_hash": "e5f2bef8349321690d9c4a820cdbf7c56dfeaf6531509e0364485def0e21c682", "notes": ""}
{"resource_id": "R005", "url": "https://ocw.mit.edu/courses/6-033-computer-system-engineering-spring-2018/resources/lecture-16-transactions-and-logging/", "extracted_text": "Lecture 16 of MIT’s Computer System Engineering course focuses on transactions and logging. The outline explains how reliable systems use transactions to ensure atomicity and durability. Logging keeps a record of changes with commit and abort records so that the system can recover consistently after failures. The lecture describes how logs are used to implement transactions, including write‑ahead logging and the use of checkpoints to limit recovery work. It also examines performance trade‑offs, caching strategies and the impact of concurrency on transaction processing, emphasising that concurrency control is needed to avoid inconsistent states when multiple transactions execute simultaneously.", "extraction_method": "html", "text_hash": "f47d7605ae489130fb08e48eae1f8752898ebc58b84539d05bea536f2159cd12", "notes": ""}
{"resource_id": "R006", "url": "https://ocw.mit.edu/courses/6-033-computer-system-engineering-spring-2018/resources/lecture-18-distributed-transactions/", "extracted_text": "Lecture 18 examines distributed transactions and the two‑phase commit protocol. The outline sets up a scenario with a client, a coordinator and several servers that must agree on a transaction outcome. Problems such as network failures and coordinator crashes are described, and the lecture details the two‑phase commit algorithm: in the prepare phase, servers vote on whether they can commit; in the commit phase, they perform the action or abort if any participant voted no. The outline discusses how to handle worker or coordinator failures, logging actions to ensure durability, and the performance costs of waiting for acknowledgments. Students learn that two‑phase commit achieves atomicity in distributed systems but can block progress if the coordinator fails.", "extraction_method": "html", "text_hash": "75a614850b97e1faf076a1048bd1602f69bd16f7a97de509d71d17a33061de09", "notes": ""}
{"resource_id": "R007", "url": "https://openstax.org/books/introduction-computer-science/pages/12-1-introduction-to-cloud-native-applications", "extracted_text": "This OpenStax section introduces cloud‑native applications and contrasts monolithic and microservices architectures. It explains that cloud‑native development relies on four key principles—microservices, containerization, continuous delivery and DevOps. Microservices break an application into self‑contained services that can be deployed independently, while monolithic architectures package the user interface, business logic and data access layers into a single codebase. Cloud‑native applications leverage container orchestrators and on‑demand cloud services to provide scalability, automation and rapid elasticity. Cloud‑based applications, by contrast, may migrate a monolithic system to the cloud but still suffer from inflexibility. The section emphasises that microservices and containerization enable applications to scale and evolve without full‑stack downtime.", "extraction_method": "html", "text_hash": "1ec34c49a710641768b3050abeb0a37b0de2ca3f1ceedd0d7028a243fec040ad", "notes": ""}
{"resource_id": "R008", "url": "https://openstax.org/books/introduction-computer-science/pages/12-2-cloud-based-and-cloud-native-applications-deployment-technologies", "extracted_text": "The deployment technologies section of the OpenStax computer science textbook describes how cloud‑based and cloud‑native applications are deployed. It introduces the major cloud service models—Infrastructure as a Service (IaaS), Platform as a Service (PaaS) and Software as a Service (SaaS)—and the deployment models (public, private, community and hybrid clouds). The text explains that cloud computing delivers servers, storage and networks over the Internet and notes that compute, storage and network resources can be provisioned on demand. IaaS gives customers control over the infrastructure, while PaaS provides middleware and development tools that reduce operational overhead. SaaS delivers complete applications. The section also contrasts deployment technologies ranging from bare‑metal servers and virtual machines to containers and serverless computing, highlighting how each option balances management complexity, scalability and cost.", "extraction_method": "html", "text_hash": "b0e0bb07ee57edcc73458840f1222897cf4e0f0cf8fca6fa718922da7068ed66", "notes": ""}
{"resource_id": "R009", "url": "https://openstax.org/books/introduction-computer-science/pages/13-3-big-cloud-paas-mainstream-capabilities", "extracted_text": "Section 13.3 of the OpenStax text discusses Platform as a Service (PaaS) mainstream capabilities and how they support Internet of Things (IoT) applications. It notes that PaaS extends Infrastructure as a Service by providing operating systems and development tools that allow organizations to focus on application development. 5G networks enable mobile edge computing for a variety of IoT devices. IoT network traffic is categorized into telemetry—sensor data sent to servers—and telecommand—commands sent to devices. The section lists application‑layer protocols used in IoT, including MQTT, AMQP and CoAP, because HTTP’s synchronous request‑response model is unsuitable for large sensor networks. A publish/subscribe protocol like MQTT allows many devices to send messages to a broker and subscribe to topics. The text explains that cloud providers such as Microsoft Azure offer IoT PaaS services with SDKs, device management and edge computing, enabling developers to build IoT solutions without maintaining local infrastructure.", "extraction_method": "html", "text_hash": "e3a85328d246be6abc72544f3eb5877b7d0a1dd8c4fc10d4244fe5b95bd5343d", "notes": ""}
{"resource_id": "R010", "url": "https://openstax.org/books/introduction-computer-science/pages/6-5-file-systems", "extracted_text": "The file systems chapter introduces distributed file systems (DFS) as file systems that run on multiple servers and present a single namespace to clients. In a DFS, clients read and write remote files as if they were local, and the system hides the physical storage location. Technologies like Google’s GFS, Hadoop’s HDFS and Spark’s Resilient Distributed Datasets (RDDs) are highlighted for processing large datasets. Replication and location transparency improve availability and performance. The section notes that protocols such as remote procedure call (RPC) and distributed hash tables (DHTs) enable communication between nodes, and traditional NFS provides a foundational example of a distributed file system. DFS operations (open, close, read and write) are location transparent, and replication ensures that data remains accessible even when nodes fail.", "extraction_method": "html", "text_hash": "3932f876098f6767ddc7f734c00363dffc48fd411c9a1a85899ed826a1b13d54", "notes": ""}
{"resource_id": "R011", "url": "https://openstax.org/books/introduction-computer-science/pages/6-6-reliability-and-security", "extracted_text": "In the reliability and security section, the textbook explains that an operating system should deliver services without errors or interruptions. To provide protection, the OS must allow resource sharing, detect and contain accidental errors, and prevent malicious abuse. The protection mechanism has three parts: authentication (verifying user identity), authorization (determining what operations a user may perform) and access enforcement (using authentication and authorization information to control access). The section describes authentication methods such as passwords, badges and two‑factor authentication, and discusses the use of access control lists (ACLs) to manage permissions. It emphasises that even small flaws in authentication or authorization can compromise the entire system.", "extraction_method": "html", "text_hash": "20862ad25dc449f2b9dd8b146d7f77f0c6406103d46369d76882c1206c76264a", "notes": ""}
{"resource_id": "R012", "url": "https://openstax.org/books/introduction-computer-science/pages/6-3-processes-and-concurrency", "extracted_text": "This section defines a process as an instance of a running program with its own address space, CPU state and resources. The operating system uses processes to execute multiple tasks concurrently rather than waiting for one task to finish before starting another. It introduces the concept of concurrent processing, in which tasks share a processor to improve performance, and explains that modern applications use client–server architectures with inter‑process communication via sockets, remote procedure calls and message passing. The text also describes the process control block (PCB) that stores metadata such as the process ID, state, registers and resource pointers. Concurrency requires careful scheduling, synchronization and isolation to avoid conflicts when multiple processes or threads interact.", "extraction_method": "html", "text_hash": "a2d5c6ff36962e40c2402ab4d29935373728a889a8eeccbe76572efb6b60a518", "notes": ""}
{"resource_id": "R013", "url": "https://openstax.org/books/introduction-computer-science/pages/4-3-parallel-programming-models", "extracted_text": "The parallel programming models section discusses the move from single‑core to multi‑core processors and defines parallel computing as executing code on multiple processors simultaneously. It distinguishes parallel computing from concurrent computing and distributed computing, noting that parallel computing typically uses shared memory while distributed computing uses message passing across networked machines. The section introduces key terms: a parallel computer is a system with multiple processors; parallel computing is the practice of using such systems; and parallel programming is the technique of dividing a task into parts that run on different processors and synchronizing the results. Examples include multicore CPUs and GPUs used for high‑performance tasks, as well as programming models that allow applications to exploit hardware parallelism.", "extraction_method": "html", "text_hash": "ad932b50d06fce8908718d567318c9d1cb7bb98e50796f0af2c46e464fc0bbaa", "notes": ""}
{"resource_id": "R014", "url": "https://openstax.org/books/introduction-computer-science/pages/6-key-terms", "extracted_text": "The key terms list for the operating systems chapter provides definitions of concepts used throughout the textbook. Terms relevant to distributed systems include: concurrency – multiple activities happening at the same time; concurrent processing – a computing model in which multiple processors execute instructions simultaneously; distributed file system – a file system distributed across multiple servers that allows network‑wide file sharing; access control list – a list of rules that specify which users are granted access to an object; authentication – verifying a user’s identity; authorization – determining which actions principals can perform; critical section – code that only one thread may execute at a time; deadlock – a situation where threads are blocked forever waiting for each other; fault tolerance – the ability of a system to continue operating when parts fail; replication – creating multiple copies of data to improve reliability and performance.", "extraction_method": "html", "text_hash": "c427925577f791cd7f7bc5947f90430f74a7e1722ba7689a42bbc873add9a575", "notes": ""}
{"resource_id": "R015", "url": "https://en.wikipedia.org/wiki/Distributed_computing", "extracted_text": "The Wikipedia article on distributed computing defines the field as the study of computer systems whose components are located on different networked computers. Components communicate and coordinate via message passing to achieve a common goal. The introduction notes that challenges include maintaining concurrency among components, operating without a global clock and tolerating independent failures. Distributed systems cost more to build than monolithic systems but can be more scalable, durable and flexible. The article states that a distributed system typically consists of autonomous nodes with their own local memory that communicate through messages. Properties of distributed systems include failure tolerance, unknown network topology, heterogeneity, dynamic membership and limited individual knowledge. Distributed computing is distinguished from parallel computing in that distributed systems use message passing rather than shared memory.", "extraction_method": "html", "text_hash": "70f70701cb1138f24b346c4b20ffbb67063fd9f821588541463c5a166c7e0fd1", "notes": ""}
{"resource_id": "R016", "url": "https://en.wikipedia.org/wiki/Scalability", "extracted_text": "The scalability article describes scalability as the property of a system to handle a growing amount of work by adding resources. For software systems, scalability may be achieved by adding additional servers or processing capacity. The article gives examples from economics and computing and notes that in distributed systems the marginal cost of additional workload should remain nearly constant for the system to be considered scalable. Scalability can be horizontal (adding more nodes) or vertical (adding resources to a single node). Various dimensions of scalability are listed, including administrative scalability (supporting more users or organizations), functional scalability (adding new features), geographic scalability, load scalability (handling heavier workloads), generation scalability (adopting newer components) and heterogeneous scalability (using components from different vendors). The article also distinguishes between scale‑out (horizontal) and scale‑up (vertical) approaches and notes that distributed applications like peer‑to‑peer systems and the Domain Name System demonstrate scalability by spreading load across many nodes.", "extraction_method": "html", "text_hash": "3c700cffe61b4fefa56e1fbf0c7a463289cc07d87fd4a4b25d7ffd5380b583f8", "notes": ""}
{"resource_id": "R017", "url": "https://en.wikipedia.org/wiki/Service-oriented_architecture", "extracted_text": "The Wikipedia entry on service‑oriented architecture (SOA) describes it as an architectural style in software design that focuses on discrete services rather than a monolithic design. It explains that services provide functionality to other components via network protocols and are intended to be vendor‑ and technology‑independent. A service is defined by four properties: it represents a repeatable business activity with a specific outcome, it is self‑contained, it is a black box for consumers (who do not need to know its internal workings), and it may be composed of other services. SOA facilitates system integration and is common in enterprise applications where services can be reused and orchestrated. Service orientation promotes thinking in terms of services and the outcomes they provide.", "extraction_method": "html", "text_hash": "18033c2557977aa074ebf17886b2f5a5449e22f1294306c496df16d85fe54752", "notes": ""}
