{"resource_id": "R1", "url": "https://ocw.mit.edu/courses/6-831-6-813-user-interface-design-and-implementation-spring-2011/", "extracted_text": "This course examines human‑computer interaction in the context of graphical user interfaces. Topics include human capabilities, principles of design and heuristics, prototyping techniques, evaluation techniques, implementation of graphical user interfaces, programming assignments and a semester‑long group project.", "extraction_method": "html", "text_hash": "b52db1693e4ddacc303c809855bd6f8c8609ddc0c72a14c8663d62096e2d96c8", "notes": "【231803977838102†L198-L209】"}
{"resource_id": "R2", "url": "https://ocw.mit.edu/courses/mas-961-ambient-intelligence-spring-2004/", "extracted_text": "This course introduces a new vision of human‑computer interaction where people are surrounded by intelligent and intuitive interfaces embedded in everyday objects. Students explore enabling technologies and study applications and experiments in smart environments, augmented and mixed realities, ubiquitous and tangible computing, intelligent interfaces and wearable computing, and develop innovative projects.", "extraction_method": "html", "text_hash": "202a21b59c8d07ae639403042e43773258438725ff90bab9dda22a901e50df38", "notes": "【502303647097266†L118-L133】"}
{"resource_id": "R3", "url": "https://ocw.mit.edu/courses/mas-632-conversational-computer-systems-spring-2004/", "extracted_text": "Explores the design of conversational computer systems for mobile computing and telephones using voice. Covers speech synthesis and recognition, telephone networks, and human interface design techniques for speech, including cognitive requirements and interface issues.", "extraction_method": "html", "text_hash": "399f418c4b0be1bf593d40cd8ec118159e017b3f107476756a3d55cb5cfdeb9a", "notes": "【464152178657391†L104-L116】"}
{"resource_id": "R4", "url": "https://ocw.mit.edu/courses/mas-965-relational-machines-fall-2005/", "extracted_text": "Focuses on the issues and challenges in building relational machines combining insights from social psychology, human‑computer interaction and design. The studio‑style course combines lectures, critiques and hands‑on design across applications for software agents and robots.", "extraction_method": "html", "text_hash": "a844a287593deda3d7ac850583f0dae176cf7a4e4cac3c3861fe3b543c27f54a", "notes": "【720940955199008†L128-L139】"}
{"resource_id": "R5", "url": "https://ocw.mit.edu/courses/21m-385-interactive-music-systems-fall-2014/", "extracted_text": "Explores audio synthesis, musical structure, human‑computer interaction and visual presentation for interactive music experiences. Topics include mixing and looping, MIDI sequencing, generative composition, motion sensors, music games and graphical user interfaces; students build interactive systems as programming assignments and final projects.", "extraction_method": "html", "text_hash": "c5a49df3a5ab2e17ebbaa0c5069eb86a17b59aee4483c3207fff526b460989c2", "notes": "【867426217973662†L121-L133】"}
{"resource_id": "R6", "url": "https://ocw.mit.edu/courses/cms-s63-playful-augmented-reality-audio-design-exploration-fall-2017/", "extracted_text": "Students explore augmented reality audio through prototype design and evaluation, investigating creative, productive, playful and social applications such as games and music. The course emphasises iterative design and rapid prototyping as research methods and challenges students to understand the limitations and strengths of these methods.", "extraction_method": "html", "text_hash": "a6962398eca0370f50eaacd03c42c61ef8c46c459bcc6932f5985c69fe34130c", "notes": "【45769236692466†L110-L124】"}
{"resource_id": "R7", "url": "https://www.oercommons.org/courseware/lesson/85296/overview", "extracted_text": "This module introduces the basics of user experience (UX) design and outlines the design process steps: empathize, define and ideate. Learners are encouraged to understand user preferences, identify interface issues, work collaboratively to brainstorm improvements, and suggest enhancements for existing apps or websites.", "extraction_method": "html", "text_hash": "fb5c74b14312a6cfd878f00c29b4fbd96a7f52acd9d2190c9fc6deca4d099500", "notes": "【400716421506707†L222-L241】"}
{"resource_id": "R8", "url": "https://www.oercommons.org/courseware/lesson/68970/overview", "extracted_text": "This microlearning guide explores universal design and accessibility, explaining concepts such as Universal Design, Universal Design for Learning, and Web Content Accessibility Guidelines (WCAG) 2.1. It invites learners to think about human variability, accessibility barriers and environmental constraints when evaluating digital interfaces and includes an activity to apply these concepts to evaluate a digital interface.", "extraction_method": "html", "text_hash": "fef2048b122ccd6f8871b8b55a60555b6e89b95584b64fd1f5ba3c7531b6ddea", "notes": "【987964184212164†L229-L239】"}
{"resource_id": "R9", "url": "https://www.fun-mooc.fr/en/courses/architecture-de-l-information/", "extracted_text": "This French MOOC introduces information architecture and teaches participants to organise digital spaces for optimal user experience and comfortable navigation across web, mobile and emerging devices. Learners explore methods and tools of information architecture, including digital understanding, information organisation, UX design mastery, cross‑disciplinary dialogue, innovation and leadership; the course is organised into sequences with collaborative exercises.", "extraction_method": "html", "text_hash": "7be6df55556c34457f4bc825cc4abc6cca164a075dd8567a9b1e218fe67d3fbc", "notes": "【692877901964876†L295-L340】"}
{"resource_id": "R10", "url": "https://pressbooks.vcc.ca/webaccessibility/chapter/introduction/", "extracted_text": "The introduction to this open book outlines learning objectives such as testing web interactivity with screen readers, distinguishing between static and dynamic WAI‑ARIA usage, understanding graceful degradation versus progressive enhancement, recognising the limitations of WAI‑ARIA, and applying accessible UI components like progress bars, sliders and alerts. It presents the book as a technical resource for developers to create accessible web interactivity using WAI‑ARIA and emphasises the importance of robust accessibility practices.", "extraction_method": "html", "text_hash": "b5934c16e5759e53c985611e30162182498ce52c02c4aa8c270414372b2911c2", "notes": "【888655596231168†L169-L188】"}
{"resource_id": "R11", "url": "https://opentextbc.ca/accessibilitytoolkit/", "extracted_text": "The Accessibility Toolkit – 2nd Edition aims to help content creators, instructional designers, technologists and educators produce open textbooks that are free and accessible for all students. It is a collaboration between BCcampus, Camosun College and CAPER‑BC and provides resources and best practices to make open educational resources truly accessible.", "extraction_method": "html", "text_hash": "e5ac0646ff4aacc7efdb5fd113283fbda64a7a6731270e6cbf79c65b1beded76", "notes": "【658159258933607†L36-L40】"}
{"resource_id": "R12", "url": "https://introductiontohci.org/", "extracted_text": "This comprehensive open access textbook provides an introduction to human‑computer interaction, covering the entire HCI process across ten parts and over 200 principles and examples. Aimed at undergraduate and master’s students from various backgrounds, the book emphasises designing better computing systems using enduring HCI principles and includes open access teaching materials.", "extraction_method": "html", "text_hash": "f919d7e71a8834f02e8a05bcc91efbadcad3fcbdf0d2ef94d9a9c0fc8dab7e23", "notes": "【368407127400282†L6-L26】"}
{"resource_id": "R13", "url": "https://ocw.mit.edu/courses/res-3-003-learn-to-build-your-own-videogame-with-the-unity-game-engine-and-microsoft-kinect-january-iap-2017/", "extracted_text": "This intensive workshop teaches participants to design, build and publish simple educational videogames using the Unity game engine and Microsoft Kinect. The course covers videogame creation, collaborative software development with GitHub, gesture handling, 3D digital object creation, game design and small team management, catering to both beginners and advanced students.", "extraction_method": "html", "text_hash": "5bf19df0b6a6276c0f98ae010f3dd3f277ba8a9967325610b85b7ce5918303d1", "notes": "【924660925489387†L170-L177】"}
{"resource_id": "R14", "url": "https://openbooks.col.org/universaldesignforlearning/front-matter_introduction.html", "extracted_text": "The Universal Design for Learning resource from the Commonwealth of Learning is licensed under a Creative Commons Attribution‑ShareAlike licence and adapts materials from BCcampus and CAST. It provides an introduction to UDL and aims to share open learning and distance education knowledge to support accessible education across diverse contexts.", "extraction_method": "html", "text_hash": "2ffacbd6b86dd3486fe91c556fc6363324ef51d0324410705f5813816590c0bf", "notes": "【896028915694722†L50-L72】"}
{"resource_id": "R15", "url": "https://oercommons.org/courseware/lesson/69462/overview", "extracted_text": "This guide explains what makes an educational resource open and why open educational resources are important for inclusive design for learning. It teaches educators how to find, use and create inclusive OER, outlining sections on supporting learning differences, benefits for educators and learners, and how to adapt or remix open resources.", "extraction_method": "html", "text_hash": "bf11a0941f87c6f453bc273f14ce370b77490a6d3536386741faf2522d048ae2", "notes": "【253233283744013†L244-L259】"}
{"resource_id": "R16", "url": "https://ecampusontario.pressbooks.pub/teachingintheopen/chapter/inclusive-accessible-design/", "extracted_text": "This chapter from the “Extending Into the Open” module discusses inclusive design, emphasising that inclusive design considers the full range of human diversity and seeks to optimise differences to create a cohesive global learning community. It outlines the inclusivity benefits of working with open educational resources, encourages adopting and adapting content to fill gaps, and provides practical strategies to make open content more inclusive for diverse learners.", "extraction_method": "html", "text_hash": "13c71481f80fb2a4a18c685089ddaea3ac522cd9240c9eb3f29bc835f20fc5f4", "notes": "【40195170288408†L118-L144】"}
