{"resource_id": "R001", "url": "https://openbooks.library.umass.edu/p132-lab-manual/chapter/introduction-to-mc/", "extracted_text": "Monte Carlo methods use probability, random numbers and computers to solve complex problems that are impossible to model with simple formulas.\nThe Physics 132 lab manual notes that these techniques were first applied in the Manhattan Project and are now used in areas such as finance, cost estimation and resource exploration【95898451853464†L173-L190】.\nA simple example explains how to estimate π by throwing random ‘darts’ at a unit square containing a circle.  The area of the circle divided by the area of the square is π/4.\nRandomly generated x and y coordinates between 0 and 1 are used as dart positions.  The fraction of darts that fall inside the circle (where √(x2+y2) < 0.5) approximates the ratio of the areas; after many trials this ratio converges to π/4 and multiplying by four yields a reasonable approximation of π【95898451853464†L193-L247】.", "extraction_method": "html", "text_hash": "9ed1064cb5d5721af910ee6f931a54e39b2e3cc06ad6f543643ad4ea185fcb81", "notes": ""}
{"resource_id": "R002", "url": "https://openbooks.library.umass.edu/p132-lab-manual/chapter/monte-carlo-error-propagation/", "extracted_text": "This section of the Physics 132 lab manual describes how Monte Carlo sampling can be used to propagate uncertainty in measured quantities.  It begins by reviewing assumptions: the population of possible measurements follows a normal distribution with mean μ and standard deviation σ, and the sample mean ī and sample standard deviation are good estimates of these parameters.\nThe manual lists formulas for the sample mean ī= (1/N)∑xi and sample standard deviation σ=√{1/(N-1)∑(xi−ī)2}, and notes that measurements are assumed to be independent【604362335647627†L166-L189】.  It then explains that to propagate error one generates many simulated measurements from the estimated normal distribution and calculates the resulting quantity of interest for each simulated trial.  The distribution of simulated results gives an empirical estimate of the uncertainty of the computed quantity.", "extraction_method": "html", "text_hash": "45164bcdb2dff8705a9f31b84ec69e8b824d33165c4f003437f82f19dee7f315", "notes": ""}
{"resource_id": "R003", "url": "https://openbooks.library.umass.edu/p132-lab-manual/chapter/monte-carlo-simulation-in-google-sheets/", "extracted_text": "This tutorial shows how to perform a simple Monte Carlo simulation using Google Sheets.  The key steps are to calculate the mean and standard deviation of the measured quantities (for example, radius and height of a cylinder), set up a spreadsheet with columns for the trial number and each variable, and then use the spreadsheet’s NORMINV function to draw random values from the estimated normal distribution.\nFor instance, a cell formula like “=NORMINV(RAND(), mean\\_radius, stdev\\_radius)” generates a random radius value.  Each row of the spreadsheet corresponds to one simulation trial; formulas are dragged down to produce many trials.  By repeating the random draws for each trial and calculating the quantity of interest (such as volume), one obtains a distribution of simulated outcomes that can be used to estimate uncertainty【874425474043268†L166-L186】.", "extraction_method": "html", "text_hash": "4d6eee75e1057aa2c66c5656adda04180b33673089fc1489e7da31f842172ba1", "notes": ""}
{"resource_id": "R004", "url": "https://pressbooks.library.torontomu.ca/pohmath/chapter/markov-chains/", "extracted_text": "This chapter introduces Markov chains, a type of stochastic process in which the outcome of each experiment depends only on the previous outcome.  The text explains that Andrei A. Markov first studied such processes in the early 1900s【77769962988438†L117-L119】. \nA transition matrix is used to describe the probabilities of moving between states.  For example, in a small town with telephone providers Mama Bell and Papa Bell, 60 % of Mama Bell customers stay and 40 % switch, while 30 % of Papa Bell customers switch to Mama Bell; this information is represented in a 2×2 transition matrix.  A transition matrix is always square, its entries are non‑negative, and each row sums to 1【77769962988438†L124-L139】.\nThe chapter notes that some Markov chains are regular and tend to stabilise in the long run.  In that case repeated multiplication of the transition matrix converges to a fixed probability vector (equilibrium vector).  The equilibrium vector E satisfies E T = E and represents the steady‑state distribution【287236348482587†L387-L409】.", "extraction_method": "html", "text_hash": "bac70a620936fc18f71419eaabc9f581e4575dc71e2f92d56baca928d8262f49", "notes": ""}
{"resource_id": "R005", "url": "https://pressbooks.bccampus.ca/ecosimug/chapter/tutorial-monte-carlo-runs/", "extracted_text": "This tutorial from the Ecosystem Modelling with EwE manual explains how to use the Monte Carlo facility in Ecosim to explore the effects of parameter uncertainty.  Users specify a coefficient of variation (for example CV = 0.4 for all groups) and a number of trials (such as 20) to generate random perturbations of model parameters.  The software then runs the model repeatedly, resampling parameters to create many plausible scenarios.\nThe text notes that the routine employs Monte Carlo and Markov Chain Monte Carlo algorithms to search for parameter combinations that improve the fit to time‑series data.  After running the trials, users can inspect the resulting distributions of outputs or save the results for further analysis.  The chapter cautions that on computers with Apple M processors, the Windows version may be required for the Monte Carlo facility to work correctly【128577741334142†L371-L434】.", "extraction_method": "html", "text_hash": "8fc517992a23971e4034597ee111c612d3fb915238a4e96618a9159a17e8d11d", "notes": ""}
{"resource_id": "R006", "url": "https://ocw.mit.edu/courses/6-041-probabilistic-systems-analysis-and-applied-probability-fall-2010/resources/lecture-16-markov-processes-i/", "extracted_text": "These lecture notes introduce discrete‑time Markov processes.  A Markov process is a sequence of random variables X0,X1,… taking values in a state space such that the conditional distribution of the next state depends only on the current state.  The notes define the one‑step transition probability r_{ij} = P(X_{n+1}=j | X_{n}=i) and n‑step transition probabilities r_{ij}(n).\nThey explain that the chain’s future evolution depends only on the present state (the Markov property) and not on the past.  States can be classified as recurrent or transient depending on whether the process returns to them with probability 1.  The lecture also discusses questions about long‑term behaviour, such as whether the Markov chain converges to a steady‑state distribution as n→∞ and how to compute hitting probabilities and expected return times【306034381472237†L76-L98】.", "extraction_method": "html", "text_hash": "78bfb450976a625db09203da147b8b6928d379e530befe5a1be4ab138ab4e55a", "notes": ""}
{"resource_id": "R007", "url": "https://ocw.mit.edu/courses/6-041-probabilistic-systems-analysis-and-applied-probability-fall-2010/resources/lecture-17-markov-processes-ii/", "extracted_text": "In this continuation of the MIT lecture on Markov processes, the notes review n‑step transition probabilities and derive conditions under which a Markov chain has a unique steady‑state distribution.  A state is positive recurrent if the expected return time is finite, and a Markov chain consisting entirely of positive recurrent states is called positive recurrent. \nThe lecture introduces birth–death processes as a special class of Markov chains with transitions only between neighbouring states and shows how to compute their stationary distributions.  It presents the steady‑state balance equations πj=Σi πi r_{ij} and explains that when the chain is irreducible and positive recurrent, the distribution of Xn converges to the stationary distribution as n increases【256651775571899†L0-L190】.", "extraction_method": "html", "text_hash": "c9929b6f0f1858498277bd9dc94281018358f49caedaf43b6b9c1d087da1b623", "notes": ""}
{"resource_id": "R008", "url": "https://openstax.org/books/introductory-statistics-2e/pages/7-1-the-central-limit-theorem-for-sample-means-averages", "extracted_text": "This OpenStax section states the central limit theorem for sample means: if random samples of size n are taken from any population with mean μ and standard deviation σ, the distribution of the sample mean ī approaches a normal distribution as n increases.  The sampling distribution has mean μ and standard deviation σ/√{n}【4968595683201†L105-L123】.\nAn example shows how to approximate the probability that the mean of a sample of 100 measurements lies between 9.5 and 10.5 when the population mean is 10 and the standard deviation is 2.  By standardising to a z‑score and using a normal cumulative distribution function, the probability can be computed numerically.  The page emphasises that the theorem holds regardless of the shape of the original population when the sample size is sufficiently large【4968595683201†L152-L174】.", "extraction_method": "html", "text_hash": "363fa82a440486a10312a5575c0608b5aaa0c601d802912e03bcd238498b8f1f", "notes": ""}
{"resource_id": "R009", "url": "https://openstax.org/books/introductory-statistics-2e/pages/7-2-the-central-limit-theorem-for-sums", "extracted_text": "This section extends the central limit theorem to sums.  If independent random variables each have mean μ and standard deviation σ, the sum of n variables has mean nμ and standard deviation √{n} σ; for large n the distribution of the sum is approximately normal【90888462278011†L104-L122】.\nFor example, suppose the total weight of 80 packages is studied and individual package weights have mean 90 and standard deviation 20.  The expected total weight is nμ=80×90=7,200 and the standard deviation of the sum is √{80}×20≈178.9.  To find the probability that the sum exceeds 7,500, one computes a z‑score for (7,500 – 7,200)/178.9 and looks up the corresponding tail probability using the normal distribution【90888462278011†L144-L170】.", "extraction_method": "html", "text_hash": "d5aa36baeb71eb50072aa1bcc15520b2e45dd7d42c4bac3950e772ab340b0c84", "notes": ""}
{"resource_id": "R010", "url": "https://openstax.org/books/introductory-statistics-2e/pages/7-3-using-the-central-limit-theorem", "extracted_text": "OpenStax clarifies how to apply the central limit theorem.  It states that the theorem should be used for sample means when calculating the probability that ī lies in an interval and for sums when calculating the probability that ∑X_i lies in an interval.  The theorem should not be used for probabilities involving individual observations【815671540246882†L104-L125】.\nThe section explains the law of large numbers, which says that as the sample size grows the sample mean tends to the population mean.  It also provides examples showing how to use the CLT to compute probabilities for sample means and sums, and cautions that the underlying distribution does not need to be normal as long as the sample size is large enough.", "extraction_method": "html", "text_hash": "86547f0216c99681c8e0665534708e40bb66bd13b5010044214d27afcd1fdf41", "notes": ""}
{"resource_id": "R011", "url": "https://openstax.org/books/introductory-statistics-2e/pages/8-1-a-single-population-mean-using-the-normal-distribution", "extracted_text": "This section explains how to construct a confidence interval for a population mean when the population standard deviation σ is known.  The point estimate for the mean is the sample mean ī, and the confidence interval has the form ī ± z_{α/2}(σ/√{n}).  The margin of error (error bound for the mean) is z_{α/2}σ/√{n}, where z_{α/2} is the z‑score corresponding to the desired confidence level【803325926615218†L107-L133】.\nThe page provides examples: for a 95 % confidence interval (α=0.05) the critical z‑value is approximately 1.96.  If the sample mean is 20 and σ=5 with n=100, the interval is 20±1.96(5/10)=20±0.98, or (19.02,20.98).  The section emphasises proper interpretation: a 95 % confidence level means that 95 % of similarly constructed intervals will contain the true population mean.", "extraction_method": "html", "text_hash": "d0a9ab53fb52c5a9429e6bed1542eeb8b9a33d50c0fb79c3de668839cd291a2a", "notes": ""}
{"resource_id": "R012", "url": "https://openstax.org/books/introductory-statistics-2e/pages/8-2-a-single-population-mean-using-the-student-t-distribution", "extracted_text": "This section recounts the discovery of the Student’s t‑distribution by William S. Gosset (who published under the pen name “Student”).  When the population standard deviation σ is unknown, the t‑distribution with n−1 degrees of freedom is used instead of the normal distribution.  The t‑distribution is symmetric like the normal distribution but has heavier tails; as the degrees of freedom increase it approaches the standard normal distribution【423026325845412†L107-L153】.\nThe notes explain that confidence intervals for a population mean are constructed similarly to the z‑intervals but with t_{α/2,n−1} replacing the z‑score and the sample standard deviation s replacing σ.  For example, with n=10 samples and s=2, a 95 % confidence interval for a mean of 50 would use t_{0.025,9}≈2.262 and have half‑width 2.262×(2/√{10}).  The section highlights that as sample size grows, the t‑distribution converges to the normal distribution【423026325845412†L136-L156】.", "extraction_method": "html", "text_hash": "f0fb98ffe961fd650dde78c34ac21ebb942d62eede2d2f1302e73ca98d1778d8", "notes": ""}
{"resource_id": "R013", "url": "https://openstax.org/books/introductory-statistics-2e/pages/9-1-null-and-alternative-hypotheses", "extracted_text": "This section defines the null hypothesis H0 as a statement of no effect or no difference, representing the status quo.  The alternative hypothesis H​\\_a is the statement the researcher seeks to support.  In a hypothesis test one must decide whether to reject H0 based on sample evidence; failure to reject H0 does not prove H0 is true【340929618509972†L106-L125】.\nThe page provides examples of hypotheses: one might test whether the proportion of voters who will vote yes exceeds 50 %, whether the average GPA of graduates of one college is lower than that of another, or whether the average time to complete a degree has decreased.  In each case H0 and H​\\_a are formulated carefully, and the test will determine whether the observed sample provides sufficient evidence to support the alternative claim【340929618509972†L146-L165】.", "extraction_method": "html", "text_hash": "a56795e8d9840dc5bb474d79db3ff2d5489abeb3837af9863e226e68c2b9a472", "notes": ""}
{"resource_id": "R014", "url": "https://openstax.org/books/introductory-statistics-2e/pages/9-2-outcomes-and-the-type-i-and-type-ii-errors", "extracted_text": "This section describes the four possible outcomes of a hypothesis test depending on whether the null hypothesis is true and whether the decision is to reject it.  A Type I error occurs when H0 is rejected even though it is true; its probability is the significance level α.  A Type II error occurs when H0 is not rejected even though it is false; its probability is β【132361040442131†L106-L140】.\nThe power of a test is 1 – β and measures the probability of correctly rejecting a false null hypothesis.  The section gives real‑world examples: calling climbing equipment safe when it is unsafe would be a Type II error, while concluding that healthy athletes are using banned substances when they are not would be a Type I error.  The article emphasises choosing α and β to make both types of errors unlikely【132361040442131†L143-L176】.", "extraction_method": "html", "text_hash": "a4c5de1e0223406ae2ebaeddf25a65267f14d66ccad8d94dd838a792936833b1", "notes": ""}
{"resource_id": "R015", "url": "https://openstax.org/books/introductory-statistics-2e/pages/9-3-probability-distributions-needed-for-hypothesis-testing", "extracted_text": "This OpenStax page summarizes which probability distributions are used for various hypothesis tests and the conditions required.  It states that a normal (z) distribution is used for tests of a population mean when the population standard deviation is known and either the population is normal or the sample size is large; Student’s t distribution is used when σ is unknown and the population is normal.  Tests for a single population proportion use the normal distribution provided that np and n(1–p) are both at least five【682371608492648†L107-L151】.\nThe section emphasises verifying the assumptions before performing a test.  It notes that for two‑sample tests of means, if both sample standard deviations are unknown one uses the Student’s t distribution with degrees of freedom given by an appropriate formula.  For two proportions, the z distribution is used as long as each sample has at least five successes and five failures.  These guidelines help practitioners choose the correct distribution for hypothesis tests【682371608492648†L107-L151】.", "extraction_method": "html", "text_hash": "e91d0c7040d63c915195ce537db4c709c14d95d6991dd5d88cbc7badcc450ca8", "notes": ""}
