{"resource_id": "R001", "url": "https://ocw.mit.edu/courses/6-864-advanced-natural-language-processing-fall-2005/", "extracted_text": "This graduate-level course provides an introduction to natural language processing (NLP) from a computational perspective. It covers models for syntactic, semantic, and discourse processing and emphasises machine learning and corpus-based methods. Students learn algorithms for fundamental NLP techniques and explore applications such as syntactic parsing, information extraction, machine translation, dialogue systems, and summarization.", "extraction_method": "html", "text_hash": "a9780696629d1cf31024fda86a3208fb", "notes": ""}
{"resource_id": "R002", "url": "https://ocw.mit.edu/courses/6-036-introduction-to-machine-learning-fall-2020/", "extracted_text": "This course introduces the principles, algorithms, and applications of machine learning from the perspective of modeling and prediction. It teaches students how to formulate learning problems, represent and evaluate hypotheses, and address challenges of over‑fitting and generalization. Topics include supervised learning and reinforcement learning with applications to image data and temporal sequences.", "extraction_method": "html", "text_hash": "ec84e4fec04389d45f3a0d95e3ea717f", "notes": ""}
{"resource_id": "R003", "url": "https://ocw.mit.edu/courses/6-0002-introduction-to-computational-thinking-and-data-science-fall-2016/", "extracted_text": "6.0002 continues the introduction to computation begun in 6.0001 and is intended for students with little or no programming experience. The course explains the role of computation in solving problems and helps students gain confidence writing small programs. Using Python 3.5, students learn computational techniques for problem solving and data analysis.", "extraction_method": "html", "text_hash": "54771d159545097362ce94f6f97c52fa", "notes": ""}
{"resource_id": "R004", "url": "https://ocw.mit.edu/courses/18-065-matrix-methods-in-data-analysis-signal-processing-and-machine-learning-summer-2018/", "extracted_text": "Linear algebra concepts are a key ingredient for understanding and creating machine learning algorithms. This course reviews linear algebra with applications to probability and statistics and optimization, and provides a full explanation of deep learning.", "extraction_method": "html", "text_hash": "6ef3d59b9d809b29e461c665e3b8e06e", "notes": ""}
{"resource_id": "R005", "url": "https://ocw.mit.edu/courses/6-867-machine-learning-fall-2006/", "extracted_text": "6.867 is an introductory graduate course on machine learning. It surveys many concepts, techniques, and algorithms, beginning with classification and linear regression and extending to more advanced topics such as boosting, support vector machines, hidden Markov models, and Bayesian networks. The course aims to provide intuition behind modern machine learning methods and the statistical inference foundations on which they rest.", "extraction_method": "html", "text_hash": "feed38031ce1d963a828b3c0dfdc11ed", "notes": ""}
{"resource_id": "R006", "url": "https://ocw.mit.edu/courses/6-034-artificial-intelligence-fall-2010/", "extracted_text": "This course introduces students to basic knowledge representation, problem‑solving, and learning methods of artificial intelligence. Students learn to develop intelligent systems by assembling solutions to concrete computational problems, understand the role of knowledge representation, problem solving and learning in intelligent‑system engineering, and appreciate the roles of vision and language in understanding human intelligence from a computational perspective.", "extraction_method": "html", "text_hash": "aad99892ef55c15aec4a49cd70abc186", "notes": ""}
{"resource_id": "R007", "url": "https://ocw.mit.edu/courses/6-0001-introduction-to-computer-science-and-programming-in-python-fall-2016/", "extracted_text": "Designed for students with little or no programming experience, this course teaches basic programming concepts and aims to provide an understanding of the role computation can play in solving problems. It helps students build confidence in writing small programs and uses the Python 3.5 language to illustrate core computing concepts.", "extraction_method": "html", "text_hash": "37a7e184094b0cffca62a21babc8380f", "notes": ""}
{"resource_id": "R008", "url": "https://datasciencebook.ca/visualize.html", "extracted_text": "This chapter introduces principles for effective data visualization, focusing on choosing the right type of plot to communicate information. It explains when to use scatter plots, line plots, bar plots and histograms, and teaches readers how to create and refine visualizations in R using the `ggplot2` package. The chapter also outlines how to evaluate and refine visualizations and warns against the misuse of pie charts and three‑dimensional plots.", "extraction_method": "html", "text_hash": "3d2a1bc88b5c097128794a2127b1b735", "notes": ""}
{"resource_id": "R009", "url": "https://datasciencebook.ca/classification1.html", "extracted_text": "This chapter provides the first introduction to predictive questions in the book by focusing on classification problems. It defines classification as using variables to predict a categorical response and discusses practical examples such as medical diagnosis and spam detection. Learning objectives include recognising when classification is appropriate, describing training data and interpreting classifier output, computing distances for nearest neighbor classifiers, using k‑nearest neighbors (KNN) classification in R, and integrating data preprocessing with model training.", "extraction_method": "html", "text_hash": "5384dc25927b642e3550968883b0dea4", "notes": ""}
{"resource_id": "R010", "url": "https://datasciencebook.ca/wrangling.html", "extracted_text": "This chapter is centred on defining tidy data—a data format that is suitable for analysis—and introduces tools for transforming raw data into this format. It presents a real‑world case study and outlines learning objectives such as defining tidy data, discussing advantages of tidy formats, understanding vectors, lists and data frames in R, and using a range of data‑wrangling functions and operators like `pivot_longer`, `pivot_wider`, `separate`, `select`, `filter`, `mutate`, `summarize`, `map`, and logical operators.", "extraction_method": "html", "text_hash": "7dd02253db561ae2bbcd4b45409a8445", "notes": ""}
{"resource_id": "R011", "url": "https://datasciencebook.ca/regression1.html", "extracted_text": "This chapter continues the exploration of predictive questions by focusing on predicting numerical variables using regression. It introduces regression as a method for predicting numeric response variables and explains the K‑nearest neighbors (K‑NN) regression algorithm. The chapter emphasises splitting data into training, validation and test sets, using workflows and cross‑validation to choose the number of neighbors, and discusses over‑fitting and under‑fitting. It also outlines learning objectives such as recognising when regression is appropriate and interpreting K‑NN regression output.", "extraction_method": "html", "text_hash": "00e189919aaa003c5bf3f3ee545ddff2", "notes": ""}
{"resource_id": "R012", "url": "https://datacarpentry.org/lessons/", "extracted_text": "The Data Carpentry program develops domain‑specific lessons for teaching researchers the skills needed for data cleaning, management, analysis and visualization. The website notes that all Data Carpentry lessons are distributed under the Creative Commons Attribution (CC BY) license and are free for reuse or adaptation with attribution. Curricula include Astronomy, Ecology, Genomics, Geospatial, Image Processing and Social Science, each designed to teach fundamental data skills using example datasets relevant to the domain.", "extraction_method": "html", "text_hash": "a20f68144c90250d46fe8cb52e053d71", "notes": ""}
{"resource_id": "R013", "url": "https://www.fun-mooc.fr/en/courses/machine-learning-python-scikit-learn/", "extracted_text": "This French MOOC provides an in‑depth introduction to predictive modeling with the scikit‑learn Python library. The course teaches fundamental methodological and software tools of machine learning, emphasising the predictive modelling pipeline, model selection, and evaluation. Topics include data preprocessing, choosing models, understanding failure modes and interpretability, and modules covering linear models, decision trees and ensemble models. The course content is licensed under the Creative Commons Attribution (CC BY) license, while learner‑contributed content is under CC BY‑NC‑ND.", "extraction_method": "html", "text_hash": "24414ebb47cfdca5c48b79cba27b46a5", "notes": ""}
{"resource_id": "R014", "url": "https://openstax.org/books/principles-data-science/pages/1-1-what-is-data-science", "extracted_text": "This section defines data science and explains that it studies how to collect, manage, and analyze data in order to derive meaningful information. It notes that data science originated across disciplines including statistics, mathematics, computer science and social science and that modern data scientists require expertise in data collection, management and analysis. The section also highlights that data preparation is often the most time‑consuming part of the data science cycle, emphasising that the field is inherently interdisciplinary.", "extraction_method": "html", "text_hash": "148233b24aaf8510699cd0f1e5e95e81", "notes": ""}
{"resource_id": "R015", "url": "https://openstax.org/books/principles-data-science/pages/1-5-data-science-with-python", "extracted_text": "In this section readers learn how to set up and use Python for data science. The learning outcomes include loading data into Python, performing basic data analysis and creating visualizations using libraries like Pandas and Matplotlib. The section introduces Jupyter Notebook (Colab) as a web‑based environment for interactive programming and provides step‑by‑step instructions for installing Colab, writing and running Python code, and understanding the differences between conventional Python and Jupyter notebook execution.", "extraction_method": "html", "text_hash": "8a20d8188d5752a6dfad40936edeb2f7", "notes": ""}
{"resource_id": "R016", "url": "https://openstax.org/books/principles-data-science/pages/1-2-data-science-in-practice", "extracted_text": "This section explores how data science is applied across a variety of fields such as business, finance, public policy, healthcare, engineering and sports. It discusses learning outcomes like explaining the interdisciplinary nature of data science, identifying real‑world examples and recognizing current issues and challenges in the field. The section illustrates how companies such as Walmart and Amazon use big data and machine learning to improve operations, predict demand and reduce delivery times, and notes applications of data science in fraud detection, weather forecasting and the Internet of Things.", "extraction_method": "html", "text_hash": "4846818360330fe3e1773ffb73074823", "notes": ""}
